[{"_id":"5c2130e9c6ec7518d48c7611","category":"Chocolate","image":"http://alray.ps/ar/thumb.php?src=uploads//images/2e3d665a5795e8e71835cc293a39b38a.jpg&w=1000&zc=1","recipes":[{"_id":"5c16f3eec1941d50c6ae0f2a","category":"Chocolate","name":"Almond-stuffed chocolate dates","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46259455.jpg?tr=w-430","http://wholesomelicious-8101.kxcdn.com/wp-content/uploads/2016/01/Dark-Chocolate-Covered-Almond-Stuffed-Dates-3.jpg","http://ediblebajaarizona.com/wp-content/uploads/2017/12/kat-davis_covered-dates_edible-baja-arizona_02.jpeg"],"ingredients":["150 g quality dark chocolate (70%)","20 large dates","60 g marzipan , optional","20 whole blanched almonds"],"method":["Break the chocolate up into pieces, then place in a glass bowl set over a small pan of simmering water, without letting the bottom of the bowl touch the water. Stir until melted, then turn off the heat.","Cut a slit down the side of each date and remove the stone. Wrap a little marzipan (heat to soften slightly), around each almond, then stuff one in each date.","One by one, dip the dates in the melted chocolate to coat, then place on a sheet of greaseproof paper to set."]},{"_id":"5c16ef9dc1941d50c6ae0f22","category":"Chocolate","name":"Rich chocolate tart with salt flakes","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1157_1_1436881223.jpg?tr=w-430","http://cdn.akairan.com/akairan/user/17/201618191627.jpg","https://lh3.googleusercontent.com/cMDX1_PW9oWwNgY5Bfu5t7pk1lK9CaZ7_8lS0t-qRMj2y9jcIOZTt3STcpTgUZj17ReVcgyEdRW_XLpYOIWc0Q"],"ingredients":["375 g shortcrust pastry","300 ml double cream","2 teaspoons caster sugar","1 pinch of fine sea salt","50 g unsalted butter , (at room temperature)","200 g dark chocolate , (70%)","50 ml whole milk","sea salt flakes","creme fraîche or ice cream"],"method":["Preheat the oven to 180°C,350°F,gas 4.","Roll out the pastry and use it to line a 23cm greased tart tin.","Cover with baking paper, fill with dried beans and bake blind for 10 to 15 minutes. Remove the beans and bake again for 15 minutes, or until golden.","Put the cream, sugar and fine sea salt in a pan and bring to the boil. Remove as soon as the mixture boils up. Off the heat, add the butter and snap in the chocolate. Stir until blended.","Take a couple of minutes for a breather, then stir in the milk. Keep stirring till shiny. Pour into the tart shell and leave at room temperature for 2 hours to set.","Sprinkle sea salt flakes lightly all over, then serve with creme fraîche or ice cream. "]},{"_id":"5c16f006c1941d50c6ae0f23","category":"Chocolate","name":"Chocolate ice cream","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1186_1_1436970676.jpg?tr=w-430","https://images.food52.com/HzawX1ZSKt66oQYV97SG0QSGwbI=/753x502/ad0a5aeb-c9e3-4ba2-877e-266f33c06b76--food52_02-19-13-0043.jpg","https://i1.wp.com/media.hungryforever.com/wp-content/uploads/2017/07/05112015/dairy-free-chocolate-ice-cream-recipe.jpg?ssl=1?w=356&strip=all&quality=80"],"ingredients":["100 g dark chocolate (70%)","300 ml full-fat milk","85 g sugar","3 free-range egg yolks","300 ml whipping cream"],"method":["Snap the chocolate into pieces, then place in a heavy-based saucepan with the milk.","Heat gently, stirring, until smooth, then remove from the heat to cool slightly.","Beat the sugar and egg yolks in a bowl until pale and thick. Stir in the cooled chocolate milk, then strain back into the pan.","Cook the custard over a gentle heat, stirring all the time, until it thickens and coats the back of a wooden spoon. Don’t allow the mixture boil or it will curdle.","Pour into a bowl and leave to cool, stirring occasionally.","Once cooled, whip the cream into soft peaks, and fold through the chocolate mixture.","Churn in an ice cream machine, according to the manufacturer’s instructions, until it’s frozen."]},{"_id":"5c16f0dbc1941d50c6ae0f24","category":"Chocolate","name":"Black forest frozen cheesecake","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46346167.jpg?tr=w-330,","https://hungryboo.com/wp-content/uploads/2016/09/black-forest-frozen-cheesecake-j-min.jpg","http://www.countryrange.co.uk/wp-content/uploads/2016/07/BLACK-FOREST-CHOCOLATE-CHEESECAKE.jpg"],"ingredients":["75 g unsalted butter , plus extra for greasing ","300 g dark chocolate biscuits","2 x 425 g tins of dark cherries in syrup","2 clementines","350 g caster sugar","6 large free-range eggs","400 ml double cream","560 g Philadelphia plain cream cheese","2 teaspoons vanilla extract","200 g dark chocolate (70% cocoa solids) , plus extra for serving","1 dash of double cream","50 g unsalted butter","1 clementine"],"method":["Preheat the oven to 180ºC,350ºF,gas 4. Grease the sides and line the base of a deep 23cm loose-bottomed cake tin.","To make the biscuit base, melt the butter in a pan over a low heat. Blitz the biscuits in a food processor until they resemble fine crumbs, then add to the melted butter.","Mix well to coat the crumbs, then tip into the prepared cake tin, spreading it out evenly.","Place in the hot oven for 10 minutes, or until darker in colour, then remove and leave to cool.","Meanwhile, to make the filling, add the tinned cherries and their syrup, the clementine zest and juice and 150g of sugar to a pan over a medium heat.","Cook for around 20 minutes, or until reduced to a syrupy consistency. Leave to cool and set aside.","Separate the egg yolks and whites into 2 separate bowls. Add the remaining 200g of sugar to the yolks, then use an electric whisk to beat for 5 to 7 minutes, or until pale and fluffy.","Whisk the egg whites until stiff peaks form.","Place the cream, cream cheese and vanilla extract into a third bowl and beat into soft peaks."]},{"_id":"5c16f15bc1941d50c6ae0f25","category":"Chocolate","name":"Chocolate coins","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46260040.jpg?tr=w-430","https://static1.squarespace.com/static/514b06eee4b0dd6717b668d6/514b06eee4b0dd6717b668df/5459460be4b0922f570b4509/1422820945748/air+force_.jpg?format=1000w","https://www.lakechamplainchocolates.com/media/catalog/product/cache/image/532x400/e9c3970ab036de70892d86c6d221abfe/a/s/assorted-chocolate-coins.jpg"],"ingredients":["300 g white, milk or dark (70%) chocolate","optional: edible gold or silver leaves, spray or glitter dust , to decorate","pistachios & honey","dried cranberries and clementine zest","freeze-dried raspberries and black pepper","flaked sea salt","roasted peanuts and honeycomb","chilli and lime zest","stem ginger and clementine zest"],"method":["Quarter-fill a medium saucepan with water and place over a medium heat.","Break the chocolate into a heatproof bowl and set it over the pan, making sure the bowl doesn’t touch the water. Stir constantly, until the chocolate has melted.","Spoon the chocolate into a jug and pour a layer, about 3mm deep, into each hole of a cupcake tray.","If using added flavours, finely chop and sprinkle them over the top.","Pop the tin in the fridge for 4 hours for the chocolate to set.","Remove the tray and bang the underside to let the coins fall out.","Decorate with edible gold or silver leaves or spray with edible glitter dust or simply leave them as they are."]},{"_id":"5c16f21ec1941d50c6ae0f26","category":"Chocolate","name":"Raw chocolate cake","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/5aT1WVlh40ABIEuzof0gPy.jpg?tr=w-430","https://data.thefeedfeed.com/recommended/post_2710723.jpeg","http://vanelja.com/wp-content/uploads/2017/01/raw-licorice-chocolate-mousse-cake-1-1024x688.jpg"],"ingredients":["300 g pecan nuts","150 g medjool dates","150 g dried figs","3 tablespoons raw honey","5 tablespoons raw cacao powder , (see note)","1½ teaspoons vanilla extract60 g cacao butter","150 g hazelnuts","3 tablespoons raw cacao powder","1½ tablespoons raw honey"],"method":["Line a 20cm springform cake tin with greaseproof paper.","To make the base, shave the cacao butter very finely into a small bowl, then place in a large bowl of hot water and allow to melt (it melts at about 34ºC, so is still considered raw).","Blitz the hazelnuts in a food processor until very fine, combine with the other base ingredients and press into the tin. Chill while you make the filling.","Blitz the pecan nuts until very fine, then add the remaining ingredients (remember to destone the dates) and blitz until everything comes together. Press into the tin and chill for at least 3 hours.","Combine the icing ingredients and chill for about 20 minutes to set a little, stirring once or twice.","Run a round-bladed knife around the edge of the cake and remove from the tin. Spread the icing on the cake with a palette knife and dust with the bee pollen (if using). "]},{"_id":"5c16f2bfc1941d50c6ae0f27","category":"Chocolate","name":"Baumkuchen","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46263011.jpg?tr=w-430","https://shop.r10s.jp/946kitchen/cabinet/kihon3/imgrc0082788683.jpg","https://images-na.ssl-images-amazon.com/images/I/51tUE6J3v0L._SX466_.jpg"],"ingredients":["220 g unsalted butter (at room temperature) , plus extra for greasing","300 g golden marzipan","100 ml single cream","225 g sugar","10 large free-range eggs","½ tablespoon vanilla extract","1 orange","150 g self-raising flour","100 g cornflour"],"method":["Preheat the grill to medium-high, and grease and line the base of a 23cm springform cake tin.","Roughly chop and place the marzipan and a little of the cream in the bowl of a standing mixer and beat using the paddle attachment until you have a thick paste. Gradually add the rest of the cream and continue to beat until you have a pale paste.","Add 170g of the butter and beat until completely incorporated. Next add the sugar and beat again until the mixture is pale and creamy.","Finally, separate and beat in the egg yolks one at a time (save the whites), then the vanilla extract. Finely grate in the orange zest.","Sift the self-raising flour and cornflour into a bowl, mix together, then, using a large metal spoon, gradually fold into the cake batter.","Whisk the egg whites to firm peaks, then fold into the batter with the large metal spoon, being careful not to knock out too much of the air.","Spoon the marmalade into a small pan and melt over a low heat, add a splash of water if needed to loosen, and keep warm. "]},{"_id":"5c16f35ac1941d50c6ae0f28","category":"Chocolate","name":"Cherry chocolate mousse","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846352.jpg?tr=w-430","https://flockler.com/thumbs/sites/192/jo_easy5_hero_cherries_chocolate_mousse_538_landscape_s600x600_c3467x2025_l0x190.jpg","https://truffle-assets.imgix.net/pxqrocxwsjcc_13zcpusaxcsg2ioaoa4uym_pankobunny_hot-chocolate-pudding_facebook-no-text-thumbnail.png"],"ingredients":["200 g quality dark chocolate , (70%)","1 x 400 g tin of black pitted cherries in syrup","200 ml double cream","4 large free-range eggs","2 tablespoons golden caster sugar"],"method":["Melt the chocolate in a heatproof bowl over a pan of gently simmering water, then remove to cool for 10 minutes. Meanwhile, simmer the cherries and their syrup in a non-stick frying pan on a medium heat until thick, then remove.","Whip the cream to very soft peaks. Separate the eggs, add the yolks to the cream with the sugar, and whisk to combine. Add a pinch of sea salt to the whites and, with a clean whisk, beat until super-stiff. Fold the cooled chocolate into the cream, then very gently fold that through the egg whites with a spatula.","Divvy up the mousse between six glasses or bowls, interspersing the cherries and syrup throughout, and finishing with a few nice cherries on top."]},{"_id":"5c16f39fc1941d50c6ae0f29","category":"Chocolate","name":"Frozen banoffee cheesecake","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846367.jpg?tr=w-430","http://shinewithnature.com/wp-content/uploads/2016/02/DSC_6580.jpg","https://img.taste.com.au/3iHXtYwd/w1200-h630-cfill/taste/2016/11/no-bake-raw-banoffee-pie-100424-1.jpeg"],"ingredients":["150 g dark chocolate (70%)","300 g packet of Hobnobs","8 overripe bananas","500 g light cream cheese","½ x 450 g jar of dulce de leche"],"method":["Rub the base of a 20cm springform cake tin with olive oil and line with greaseproof paper, then rub the paper with oil, too. Melt 50g of chocolate in a heatproof bowl over a pan of gently simmering water, then remove. Snap the Hobnobs into a food processor and blitz with 2 tablespoons of extra virgin olive oil until well combined. Drizzle in the melted chocolate, then pulse again. Pat into the cake tin in a 1cm-thick layer.","Peel the bananas, tear into the food processor, add the cream cheese and dulce de leche, blitz well until nice and smooth, then pour over the biscuit base. Freeze overnight or until needed, transferring to the fridge for 2 hours before serving, or until it’s the slicing consistency you like.","Loosen the edges of the cheesecake with a palette knife, then release from the tin. Shave or grate over the remaining chocolate, and serve. Delicious."]},{"_id":"5c16f48fc1941d50c6ae0f2b","category":"Chocolate","name":"Vegan chocolate tart with rhubarb","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/1SBaejl_qVVAEca03U41WR.jpg?tr=w-430","https://i1.wp.com/www.everescents.com.au/wp-content/uploads/180712-chocolate-tart-web-mini.jpg?fit=1200%2C800&ssl=1","https://www.bhg.com.au/media/5462/choc-ganache-and-raspberry-tart-07.jpg"],"ingredients":["150 ml soya milk","4 cardamom pods","4 tablespoons sugar","1 tablespoon cornflour","250 g dark vegan chocolate (70%)","1 teaspoon vanilla extract","250 g plain flour","125 g icing sugar"],"method":["Preheat the oven to 180°C,350°F,gas 4. Lightly grease a 25cm loose-bottomed tart tin.","To make the pastry, sift the flour, icing sugar and ginger into a large bowl. Roughly chop and add the margarine and, working quickly, rub into the dry ingredients. Add enough cold water so you can bring the mixture together into a ball. Wrap the dough in clingfilm and chill for 30 minutes.","Once chilled, roll the pastry to ½cm thick and line the tin. Trim any excess and prick all over with a fork. Return to the fridge for 30 minutes.","Bake the pastry blind for 15 minutes. Remove the weight and cook for a further 10 to 15 minutes, until golden brown and cooked through.","For the filling, place the soya milk in a small pan with 200ml water, crush and add the cardamom pods, and the sugar, then warm over a low heat.","Put the cornflour in a small bowl with a few tablespoons of the warm soya mixture and stir till smooth, then return to the pan, stirring to combine, and bring back to the boil. Remove the cardamom pods.","Snap the chocolate into a bowl and pour over the hot soya. Stir to combine. Add the vanilla extract and a pinch of sea salt, pour into the case, chill for 5 to 6 hours."]}]},{"_id":"5c2131a9025c861a15d44baa","category":"Chicken","image":"https://img.atyabtabkha.com/JHy0-oEXYsPk0toIOx_LbTzyRdI=/640x360/http://harmony-assets-live.s3.amazonaws.com/image_source/b1/dd/b1dd498275fbb203a8305e74cfa22f5c43f5a104.jpg","recipes":[{"_id":"5c16c111c1941d50c6ae0efa","category":"Chicken","name":"Roast chicken with all the trimmings","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/761_1_1436881947.jpg?tr=w-430","https://simply-delicious-food.com/wp-content/uploads/2010/03/Roast-chicken-009.jpg","https://gbc-cdn-public-media.azureedge.net/img9489.768x512.jpg"],"ingredients":["freshly ground black pepper","1 large higher-welfare chicken","olive oil","1 bulb garlic , cut in half horizontally","1.5 kg root vegetables (potatoes, carrots, sweet potatoes, parsnips) , peeled","24 rashers higher-welfare streaky bacon","24 higher-welfare chipolatas","extra virgin olive oil","1 lemon","100 g butter , softened","1 small bunch fresh thyme","sea salt "],"method":["Preheat the oven to 200°C","400ºF","gas 6. Soak 24 wooden skewers in a bowl of cold water. Finely grate the zest from the lemon and mix with the softened butter. Put half the thyme sprigs to one side, and pick the leaves off the remaining sprigs. Mix the thyme leaves with the lemony butter and season with salt and pepper.","Place the chicken in a roasting tray and rub all over with the flavoured butter. Drizzle with a good lug of olive oil. Slice the lemon in half and, with the thyme sprigs, stuff into the cavity of the chicken. Add the garlic to the tray and roast in the oven for 1 hour and 15 minutes or until the chicken is cooked and golden brown (when pierced with a knife, the juices should run clear).","Meanwhile, cut the root vegetables into large, even-sized chips. Parboil the potatoes and carrots for 6 minutes in salted, boiling water and, after 3 minutes, add the sweet potatoes. Drain in a colander and allow to steam dry for a few minutes. Spread the chips on a baking sheet in a single layer, drizzle with a little olive oil and lightly season with salt. Toss lightly and, when the chicken has been in the oven for half an hour, slide in the baking sheet so the chicken and vegetables can roast together for the final 45 minutes.","Lay out your bacon rashers and glide over them with the back of your knife to stretch them a little – this will prevent them from shrinking when they cook. Wrap each chipolata with a bacon rasher, then thread 2 chipolatas on to each skewer in little U-shapes. After the chicken has had 45 minutes in the oven, take it out and arrange the sausage skewers around it. Place it back in the oven for another 30 minutes until the chicken is golden brown and cooked and the sausages are crispy and sticky.","Leave the chicken to rest for 10 minutes, then place it in a large dish and arrange the root vegetable chips and sausage skewers around it. It’s lovely served with steamed green broccoli and peas – delicious.","You can make a quick one by skimming off the fat in the roasting tray, then placing the tray on the hob. Stir in a couple of tablespoons of flour and some stock until thickened, and strain through a sieve. "]},{"_id":"5c16c266c1941d50c6ae0efb","category":"Chicken","name":"Golden chicken","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/839_1_1436799124.jpg?tr=w-430","https://cdn-image.myrecipes.com/sites/default/files/styles/medium_2x/public/image/recipes/rs/2006/golden-chicken-rs-1225767-x.jpg?itok=n_tSEOl3","http://goldenchick.com/assets/menu-images/_resampled/SetWidth640-GoldenChick-11-13-8.jpg"],"ingredients":["800 g potatoes","3 onions","olive oil","1 organic chicken stock cube","½ a bunch of fresh sage","100 ml single cream","30 g Parmesan cheese","4 x 120 g skinless higher-welfare chicken breasts","a few sprigs of fresh rosemary","2 rashers of higher-welfare smoked streaky bacon","200 g baby leeks","200 g baby spinach","200 g frozen peas"],"method":["Scrub the potatoes clean, finely slice in the processor, then tip into the medium pan and cover with boiling water and the lid.","Peel the onions, finely slice in the processor, then tip into the roasting tray with 2 tablespoons of oil, crumble in the stock cube and season with sea salt and black pepper.","Tear in the sage leaves and stir regularly, adding a splash of water if they start to catch.","On a large sheet of greaseproof paper, toss the chicken with salt, pepper and the rosemary leaves, then fold the paper over and bash and flatten the chicken to 1.5cm thick with a rolling pin.","Put into the frying pan with 1 tablespoon of oil, turning after 3 or 4 minutes, until golden and cooked through.","Drain the potatoes well in a colander, then tip into the onion pan, stir together and arrange in a flat layer. Pour over the cream, then finely grate over the Parmesan and pop under the grill on the top shelf.","Halve the leeks lengthways, rinse under the tap, then finely slice. Put into the empty lidded pan on a high heat with 1 tablespoon of oil, stirring often.","Finely slice the bacon and add to the chicken pan, tossing regularly.","Stir the spinach and peas into the leeks and once the spinach has wilted and the peas are tender, pile on a board or platter with the chicken and bacon on top. Serve with the gratin."]},{"_id":"5c16c31ec1941d50c6ae0efc","category":"Chicken","name":"Quick crispy chicken with tomatoes & asparagus","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/904_1_1436880471.jpg?tr=w-430","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1284501_9.jpg?itok=bgIavWaA","http://www.reynoldskitchens.com/sites/default/files/styles/hero_image/public/recipes/RW_Jan%20FSI%20image%20500x500px.jpg?itok=PKKADXop"],"ingredients":["2 x 120 g free-range, skinless chicken breasts","sea salt","freshly ground black pepper","1 bunch of asparagus","olive oil","4 rashers of higher-welfare pancetta","250 g cherry tomatoes , halved","5 black olives , destoned","a couple of sprigs of fresh basil , leaves picked","a small knob of butter","a splash of white wine"],"method":["This is a really quick and simple meal that’s perfect for a midweek supper. I’ve used olives to add a bit of saltiness and extra flavour, but feel free to throw in whatever you’ve got in the cupboard that’ll do the same job – anchovies or sun-dried tomatoes would work well.","Place a large pan on a high heat. Lay your chicken breasts on a board and cut three incisions into each one like fingers, going all the way through the breast but leaving about 1cm joined at the top. Sprinkle with a pinch of salt and pepper. Snap the woody ends off of the asparagus spears. Add a splash of olive oil to the pan, followed by the chicken, pancetta and asparagus. Cook for 10 minutes, or until the chicken and asparagus are cooked through, turning halfway. Lift the pancetta on top of the chicken once golden and crispy.","Move the chicken, bacon or pancetta and asparagus to one side of the pan then throw in the tomatoes, olives, basil leaves and butter. Reduce to a low heat and add a splash of wine to help make a sauce. Leave to bubble away and thicken for a couple of minutes.","Use tongs to divide the chicken, bacon or pancetta, asparagus and most of the tomatoes between your plates. Squash the remaining tomatoes, mixing them with the lovely juices in the pan, then drizzle over the chicken before serving."]},{"_id":"5c16c3edc1941d50c6ae0efd","category":"Chicken","name":"Sweet & spicy beer can chicken","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46334202.jpg?tr=w-430","http://4.bp.blogspot.com/-aJvbEbaqywY/U7SCVyD3pZI/AAAAAAAANiA/HXpgLUYnHwg/s1600/IMG_0222.jpg","https://www.theprairiehomestead.com/wp-content/uploads/2015/12/Rotisserie-Style-Chicken-Plated.jpg"],"ingredients":["1 x 1.8 kg whole free-range chicken","olive oil","1 x 300 ml can of beer","2 tablespoons barbecue sauce","1 fresh red chilli , deseeded","1 bunch of spring onions , trimmed","½ a bunch of fresh coriander","1 heaped tablespoon smoked paprika","1 heaped teaspoon cayenne pepper","1 heaped tablespoon fennel seeds","1 heaped tablespoon coriander seeds","1 teaspoon cumin seeds","1-2 dried red chillies","1 heaped teaspoon sea salt","1 heaped tablespoon freshly ground black pepper","1 heaped tablespoon soft dark brown sugar"],"method":["I first roasted chicken like this when I visited the US – the steam from the beer creates the most amazingly juicy results.","Preheat the oven to 200ºC,400ºF,gas 6. Remove the chicken from the fridge and leave aside to come up to room temperature. Bash the rub ingredients to a fine powder in a large pestle and mortar, then drizzle the chicken with olive oil. Sprinkle over the rub and use your hands to massage all those lovely flavours into all the nooks and crannies.","Crack open the beer and pour out around two-thirds of it (or drink it!), then carefully lower the chicken cavity onto the can so it looks like it’s sitting up. Position the chicken so it’s upright on a roasting tray, then place in the oven and cook for around 1 hour 10 minutes, or until golden and cooked through. To check it’s done, insert a knife into the thickest part of the thigh – the juices should run clear.","Brush the chicken all over with the barbecue sauce, then return to the oven for a further 10 minutes, or until dark and sticky. Meanwhile, finely slice the chilli and spring onions and pick the coriander leaves. Once ready, carefully remove and discard the can, then carve up the bird, scatter over the chilli, spring onions and coriander leaves, then serve. "]},{"_id":"5c16c5e8c1941d50c6ae0eff","category":"Chicken","name":"Ginger & honey chicken wings","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1194_1_1437994096.jpg?tr=w-430","https://img.taste.com.au/8QLQgRZe/w720-h480-cfill-q80/taste/2016/11/honey-and-ginger-chicken-wings-98761-1.jpeg","https://ivegotcake.files.wordpress.com/2015/01/ivc_9939_1.jpg"],"ingredients":["24 higher-welfare chicken wings","5 spring onions","1 fresh red chilli","5 tablespoons runny honey","2 tablespoons soy sauce","2 cm piece of ginger","5 sprigs of fresh thyme"],"method":["Trim and finely slice the spring onions and chilli, placing them into a bowl with the honey and soy sauce. Peel, then grate in the ginger, and pick in the thyme leaves. Mix well.","Place the chicken sings in a single layer in a wide, shallow, non-reactive dish. Pour or brush over the marinade, cover and place in the fridge to marinate for 24 hours.","Cook the wings on a hot barbecue or griddle pan for 15 to 20 minutes, or until dark and the juices run clear, turning often. If cooking on a griddle, finish the wings in the oven at 180ºC","350ºF","gas 4 for 10 to 15 minutes to make sure they’re cooked through."]},{"_id":"5c16c4a0c1941d50c6ae0efe","category":"Chicken","name":"Pukka yellow curry","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1100_1_1436875132.jpg?tr=w-430","http://2.bp.blogspot.com/--5xfEZVMYYQ/VBQHFCC26tI/AAAAAAAAIZ8/d0W6y_yZd-c/s1600/DSC05813.jpg","https://i.pinimg.com/originals/e6/a4/3b/e6a43be7da8099ca8ef0c4a4762d64a0.jpg"],"ingredients":["2 onions","4 cloves of garlic","5 cm piece of ginger","2 yellow peppers","1 organic chicken stock cube","1-2 fresh red chillies","½ a bunch of fresh coriander , (15g)","1 teaspoon runny honey","1 level teaspoon ground tumeric","2 teaspoons curry powder","8 free-range chicken drumsticks","olive oil","1 x 400 g tin of chickpeas","1 teaspoon tomato purée","1 mug of basmati rice , (320g)","1 lemon","fat-free natural yoghurt , optional"],"method":["Peel the onions, garlic and ginger and deseed the peppers.","Put 1 onion, 1 pepper, the garlic and ginger into a food processor. Crumble in the stock cube and add the chilli (deseed it first, if you prefer a milder curry), the coriander stalks, honey and spices, then blitz to a paste.","Place a large casserole pan on a medium-high heat and fry the chicken drumsticks (pull the skin off first, if you prefer) with a splash of oil for 10 minutes, or until golden, turning occasionally with tongs. Remove the chicken to a plate, leaving the pan on the heat.","Roughly chop the remaining onion and pepper and add to the pan to cook for a few minutes, then tip in the paste and let it cook down for around 5 minutes.","Pour in 500ml of boiling water. Drain the chickpeas and add along with the tomato purée and a pinch of sea salt and black pepper, then stir well.","Return the chicken to the pan, pop the lid on, reduce the heat and simmer gently for around 45 minutes, or until the sauce darkens and thickens.","With 15 minutes to go, put 1 mug (320g) of rice and 2 mugs of boiling water into a pan with a pinch of salt and simmer with the lid on for 12 minutes, or until all the liquid has been absorbed.","Serve the curry in the middle of the table with a few dollops of yoghurt (if using) and a scattering of coriander leaves, with lemon wedges for squeezing over and the fluffy rice on the side."]},{"_id":"5c16c6bbc1941d50c6ae0f00","category":"Chicken","name":"Cracking chicken burrito","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1572_2_1437661500.jpg?tr=w-430","http://ackermancancercenter.com/images/uploads/breakfast_wrap_2.jpeg","https://d5bzqyuki558t.cloudfront.net/cms-assets/system/asset_versions/attachments/000/000/447/original/CMG_Menu_0000_Burrito.jpg?1429136820"],"ingredients":["4 skinless, boneless free-range chicken thighs","1 tablespoon sweet smoked paprika","½ a tablespoon ground cumin","olive oil","2 cloves of garlic","1 bunch of fresh coriander","1 x 400 g tin of pinto or black beans","200 g leftover white or brown rice , chilled","1 lime","4 ripe tomatoes","4 spring onions","1 little gem lettuce","4 large flour tortillas","80 g mature Cheddar cheese","4 tablespoons Greek yoghurt"],"method":["Preheat a griddle pan over a high heat. Meanwhile, place the chicken thighs between two sheets of greaseproof paper, then bash with the base of a heavy pan to roughly ½cm thick. Pop into a bowl, sprinkle over the paprika, cumin and a lug of oil, and season well with sea salt and freshly ground black pepper.","Mix well to coat, then place the chicken onto the hot griddle. Cook for 10 minutes, or until charred and cooked through, turning halfway. Leave to cool slightly.","Meanwhile, peel and finely slice the garlic. Pick the coriander leaves and set aside, then finely slice the stalks. Heat 1 tablespoon of oil in a large frying pan over a medium-high heat, add the garlic and coriander stalks and fry for 1 minute.","Drain, rinse and add the beans, then fry for a further few minutes. Add the rice and cook for 5 minutes, or until crisp and piping hot through, stirring occasionally. Finely grate in the lime zest, roughly chop and add half the coriander leaves. Stir well and remove from the heat.","Roughly chop the tomatoes and trim and finely slice the spring onions, then add to a bowl with the juice of the lime. Roughly chop and add the remaining coriander leaves, mix well and season to taste. Shred the lettuce and cooled chicken.","Pop a tortilla onto the griddle for 1 minute to soften, then place onto a board. Spoon one-quarter of the fried rice and beans along the middle, top with a generous spoonful of salsa, a handful of lettuce and one of the shredded chicken thighs. Grate over some cheese and add a spoon of yoghurt.","Wrap up the burrito, then tuck in. Repeat with the remaining ingredients, serving as you go."]},{"_id":"5c16c756c1941d50c6ae0f01","category":"Chicken","name":"Food Allergy Mums' chicken drumsticks","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/4z5CkBWEqaP83dEWBKDc02.jpg?tr=w-430","https://s-media-cache-ak0.pinimg.com/236x/7d/28/32/7d283292bb03483f78a6343496a0f499.jpg","https://s-media-cache-ak0.pinimg.com/originals/87/89/f5/8789f575b2ba4f492de89885275938da.jpg"],"ingredients":["olive oil","6-8 chicken drumsticks , (depending on the age and appetite of your children)","½ a red pepper","½ a yellow pepper","½ an orange pepper","1 lemon","200 ml fresh organic chicken stock , (see tip)","1 small bay leaf","1 small handful of fresh parsley"],"method":["Preheat the oven to 200°C,400°F,gas 6.","Heat a little oil in a frying pan over a medium to high heat and add the chicken drumsticks. Cook for a few minutes, just to allow the skin to take on a bit of colour.","Deseed and slice the peppers and cut the lemon into quarters.","If your frying pan is ovenproof, add the rest of the ingredients (apart from the parsley) to the pan. If not, just transfer the chicken drumsticks to a roasting tin and then add the rest of the ingredients (apart from the parsley).","Season with freshly ground black pepper to taste. Pop in the oven for 30 to 35 minutes to cook. The chicken skin should be golden and the flesh cooked through (check by cutting into a thick piece of the drumstick to see that the juices are clear), the stock will have reduced to make a nice sauce, with a subtle lemon taste. If you prefer a thicker sauce, you can reduce it a little further on the hob.","Remove the lemon quarters and bay leaf. Chop the parsley and sprinkle over before serving. "]},{"_id":"5c16c839c1941d50c6ae0f02","category":"Chicken","name":"Moroccan-style roast chicken","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46263741.jpg?tr=w-430","https://img.taste.com.au/3rSmHj9i/taste/2016/11/moroccan-style-roast-chicken-2087-1.jpeg","https://realfood.tesco.com/media/images/Indian-spiced-roast-chicken-LGH-5e23f367-fdad-4948-bd98-bb80b6d9bded-0-1400x919.jpg"],"ingredients":["2 preserved lemons","1 tablespoon ras el hanout","1 dried chilli","1 x 1.6kg whole free-range chicken","olive oil","1 teaspoon rose petals (unsprayed) , optional","a few sprigs of fresh coriander"],"method":["Preheat the oven to 180ºC,350ºF,gas 4.","Finely chop 1 of the preserved lemons and bash together with the ras el hanout, dried chilli and a pinch of sea salt and black pepper using a pestle and mortar.","Slice the remaining lemon and divide between the base of a roasting tray and the cavity of the chicken.","Slash the chicken breast a few times and rub in the marinade. Drizzle with oil, rub again, and place in the roasting tray.","Scatter with rose petals (if using), and roast for 1 hour 20 minutes, until the skin is sticky and chicken is cooked. Pick, then scatter over the coriander leaves to serve. "]},{"_id":"5c16c906c1941d50c6ae0f03","category":"Chicken","name":"Super roast chicken & chips","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46260266.jpg?tr=w-430","https://static01.nyt.com/images/2016/01/15/dining/15COOKING-BUTTERMILKROASTCHIC2/15COOKING-BUTTERMILKROASTCHIC2-superJumbo.jpg","https://www.seriouseats.com/recipes/images/2016/11/20161102-Chicken-Sausage-Sprouts-03-1500x1125.jpg"],"ingredients":["2 kg Maris Piper potatoes","2 lemons","1 x 3-3.5 kg whole free-range super chicken","olive oil","5 cloves of garlic","½ a bunch of fresh thyme (15g)","½ a bunch of fresh chervil (15g)","½ a bunch of fresh basil (15g)","½ a bunch of fresh flat-leaf parsley (15g)","4 tablespoons fat-free Greek yoghurt","extra virgin olive oil","1 bulb of fennel","¼ of a white cabbage","4 medium carrots"],"method":["Preheat the oven to 180ºC,350ºF,gas 4. If your chicken has been refrigerated, let it come up to room temperature.","Cut the unpeeled potatoes into 2cm-thick chips, then parboil in a pan of salted water with one of the whole lemons for 4 to 6 minutes.","Drain in a colander (remove the lemon and set aside for the dressing), leave to steam dry for a couple of minutes, then shake them around a little to create rough edges – this will help to make them nice and crispy.","Massage a little olive oil, sea salt and black pepper into the chicken. Halve the remaining lemon, then rub one half over the bird, before popping both halves into the cavity.","Place the chicken, breast-side-down, directly on the grills in the middle of the oven – most of the fat is in the back of the bird, so this will allow the juices to run into the breast and keep all of the meat moist.","Position a tray on the shelf below to catch the juices (you’ll need these for the chips), and roast the chicken for 1 hour 30 minutes, or until cooked through, turning the chicken over after 45 minutes to crisp up the rest of the skin.","Once you have 30 minutes of cooking time left, add the parboiled chips and thyme to the tray with the chicken juices, stirring to coat. Smash and add the garlic, season it all and pop in the oven to cook, tossing after 15 minutes.","Once the chicken is cooked, take it out of the oven and turn up the temperature to 200ºC","400ºF","gas 6. Leave the chips in for 5 to 10 minutes, or until crisped up, while the chicken rests.","To make the dressing, halve the boiled lemon and scoop the jammy insides into a bowl. Very finely chop half of the skin (avoiding the bitter pith) and add this too. "]}]},{"_id":"5c21339f579c101cd8d0263f","category":"Pasta","image":"http://yamalalsham.com.sa/wp-content/uploads/2017/04/5a-600x597.jpg","recipes":[{"_id":"5c16d6cac1941d50c6ae0f04","category":"Pasta","name":"Sausage linguine","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77878570.jpg?tr=w-430","https://images.food52.com/C47BkRdWxoITR0TVBpxtsU10jJs=/753x502/31fa137e-b2f0-4a04-b60c-184b7e45cd52--110111F_276.JPG","https://img.taste.com.au/gGK7jA7X/w720-h480-cfill-q80/taste/2016/11/chorizo-and-prawn-fideos-81488-1.jpeg"],"ingredients":["150 g dried linguine","200 g broccoletti , or sprouting broccoli","olive oil","1 large higher-welfare sausage , (125g)","1 clove of garlic","2 anchovy fillets in oil , from sustainable sources","1 pinch of dried red chilli flakes","100 ml Frascati white wine","20 g pecorino , or Parmesan cheese","extra virgin olive oil"],"method":["Cook the pasta in a pan of boiling salted water according to the packet instructions, then drain, reserving a mugful of starchy cooking water.","Meanwhile, trim the broccoletti (halving any thick stalks lengthways to make them more delicate to eat). Place a large frying pan on a medium heat with 1 tablespoon of olive oil. Squeeze the sausagemeat out of the skin into the pan, breaking it up with a wooden spoon. Once lightly golden, peel, roughly chop and add the garlic, followed by the anchovies, chilli flakes, broccoletti and wine. Leave to bubble away while the pasta cooks.","Toss the drained pasta into the sausage pan, then finely grate over the pecorino and drizzle with extra virgin olive oil. Toss again, loosening with a little reserved cooking water, if needed, to create a light, creamy sauce. Taste and season to perfection, then serve right away."]},{"_id":"5c16d73dc1941d50c6ae0f05","category":"Pasta","name":"Prawn & tuna linguine","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77638953.jpg?tr=w-430","https://ichef.bbci.co.uk//food/ic/food_16x9_832/recipes/linguinewithtunafish_70041_16x9.jpg","https://assets.bonappetit.com/photos/5870289251bb6411199522a0/16:9/w_1200,c_limit/linguine-with-anchovies-and-tuna.jpg"],"ingredients":["2 small onions","4 large raw shell-on prawns , from sustainable sources","olive oil","1 cinnamon stick","2 anchovy fillets in oil , from sustainable sources","1 good pinch of saffron","4 tablespoons white wine vinegar","50 g shelled unsalted pistachios","pecorino or Parmesan cheese rind","150 g dried linguine","200 g yellowfin tuna , from sustainable sources","½ a bunch of fresh flat-leaf parsley , (15g)"],"method":["Peel and finely slice the onions, and place them in a bowl of water. Pull off the prawn heads and put just the heads into a cold frying pan with 2 tablespoons of oil and the cinnamon. Place on a medium heat and, once sizzling, add the anchovies. Drain the onions and toss into the pan. Cover and cook for 20 minutes, or until super-soft, stirring occasionally and adding a splash of water, if needed. Meanwhile, peel the prawns, run a small sharp knife down the back of each to butterfly them, then pull out and discard the vein. Steep the saffron in a splash of boiling water and the vinegar. Pound the pistachios in a pestle and mortar. And, for another Rosanna trick, finely grate a little pecorino rind, for seasoning.","Cook the pasta in a pan of boiling salted water according to the packet instructions. Meanwhile, chop the tuna into erratic 1cm chunks, and finely chop the top leafy half of the parsley. With 2 minutes to go on the pasta, remove the lid from the onions and turn the heat to high. Gently squash each prawn head so all the tasty juices spill out into the pan, then discard the heads and the cinnamon. Stir in half the parsley, then break the frying by adding the saffron vinegar mixture. Stir in the prawns and tuna, then use tongs to drag the pasta straight into the pan, letting a little starchy cooking water go with it. Toss over the heat for 2 minutes, loosening with a little extra cooking water, if needed. Turn the heat off, quickly toss in the grated pecorino rind and the pistachios, taste and check the seasoning, then sprinkle over the remaining parsley. "]},{"_id":"5c16d7c8c1941d50c6ae0f06","category":"Pasta","name":"Tortiglioni","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77878569.jpg?tr=w-430","https://img.taste.com.au/sv6b4Rpw/taste/2016/11/chorizo-capsicum-and-tomato-tortiglioni-51586-1.jpeg","http://www.cbc.ca/inthekitchen/assets_c/2012/11/Puttanesca32-thumb-596x350-247066.jpg"],"ingredients":["350 g fresh peas , in their pods","80 g piece of higher-welfare guanciale (cured pig’s cheek) , or smoked pancetta","150 g dried tortiglioni , or rigatoni","2 shallots","½ a lemon","½ a bunch of fresh mint , (15g)","30 g pecorino cheese , plus extra to serve","extra virgin olive oil","pea shoots , to serve (optional)"],"method":["Pod the peas and place just the pods in a pan of boiling salted water for 5 minutes to impart their flavour. Finely dice the guanciale, place in a large cold non-stick frying pan and put on a medium heat to render the fat, tossing regularly. Meanwhile, scoop out and discard the pea pods, then cook the pasta in the boiling salted water according to the packet instructions. Peel and rustically chop the shallots, then add to the guanciale pan for 5 minutes, or until lightly golden. Add the peas and a good splash of water, then finely grate in the lemon zest. Cover and cook gently for 5 minutes, tossing occasionally, while you rip the top leafy half off the mint and finely chop it, and finely grate the pecorino.","Drain the pasta, reserving a mugful of starchy cooking water. Pour the pasta into the frying pan, then remove from the heat and toss well so the pasta absorbs maximum flavour. Stir in the mint and pecorino, jiggling the pan to create creaminess. Loosen with a little cooking water, if needed, season to perfection, then serve with an extra grating of pecorino, a kiss of extra virgin olive oil, a squeeze of lemon, and a few pea shoots, if you like. "]},{"_id":"5c16d853c1941d50c6ae0f07","category":"Pasta","name":"Mushroom & cauliflower penne","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46325031.jpg?tr=w-430","https://www.thechunkychef.com/wp-content/uploads/2015/05/Roasted-Mushroom-and-Cauliflower-Carbonara-12-1024x683.jpg","https://www.feastingathome.com/wp-content/uploads/2017/07/Cauliflower-Pasta-111.jpg"],"ingredients":["2 cloves of garlic","1 onion","1 fresh red chilli","15 g fresh thyme","250 g chestnut mushrooms","320 g cauliflower","olive oil","200 g wholewheat penne","15 g fresh flat-leaf parsley","100 g ricotta cheese","1 lemon","20 g Parmesan cheese"],"method":["Fill a large pan with salted water, place on a high heat and bring to the boil.","Meanwhile, peel and finely slice the garlic and onion, then halve, deseed and finely slice the chilli. Pick the thyme leaves.","Trim and slice three-quarters of the mushrooms. Trim the cauliflower, remove and discard the leaves, then chop the cauliflower florets and stalk into small chunks.","Heat 1 tablespoon of oil in a wide saucepan on a medium heat, add the garlic, onion, chilli and thyme, then cook gently for 10 minutes, or until golden.","Add the sliced mushrooms and cauliflower, cover with a lid and cook gently for about 10 minutes, or until softened.","Meanwhile, add the pasta to the boiling water and cook for 10 to 12 minutes, or until al dente – this means it’s cooked, but still has a bit of bite.","Meanwhile, pick and finely chop the parsley leaves. Trim and very finely slice the remaining mushrooms.","Once softened, mash the cauliflower mixture with a fork until broken down, but still with a bit of texture. Stir in the ricotta, then season to taste with sea salt, black pepper and the juice from half the lemon.","Reserving a cupful of the cooking water, drain the pasta and return it to the pan, off the heat. Tip in the sauce and stir well, adding splashes of the cooking water to loosen, if needed. Taste and season with salt, pepper and the remaining lemon juice.","Stir in the sliced raw mushrooms, most of the Parmesan cheese and half of the parsley leaves. Serve with the remaining chopped parsley and cheese sprinkled on top. "]},{"_id":"5c16d8c4c1941d50c6ae0f08","category":"Pasta","name":"Spinach lasagne","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/2ipm2HQHql2Azq2dLfiA4k.jpg?tr=w-430","https://www.seriouseats.com/recipes/images/2014/11/20141023-spinach-lasagna-food-lab-01-1500x1125.jpg","https://hips.hearstapps.com/del.h-cdn.co/assets/17/38/1506010503-spinach-lasagna-delish.jpg"],"ingredients":["70 g unsalted butter","50 g plain flour","800 ml milk","1 fresh bay leaf","800 g spinach","200 g ricotta cheese","1 whole nutmeg , for grating","300 g fresh lasagne sheets","100 g Parmesan cheese"],"method":["Preheat the oven to 190°C,375°F,gas 5.","Melt 50g of the butter in a pan and whisk in the flour. Cook for 1 to 2 minutes, then whisk in the milk till smooth. Season with sea salt and freshly ground black pepper, add the bay leaf and simmer for 5 minutes. Turn off the heat.","Remove the stalks from the spinach, then wilt with the remaining 20g butter in a covered pan. When wilted, drain, then, when cool enough to handle, squeeze out the liquid.","Chop the spinach and mix with the ricotta, a ladleful of the white sauce and a good grating of nutmeg. Season.","In a baking dish, layer the lasagne sheets, white sauce, spinach mixture and a grating of Parmesan. Finish with a layer of pasta topped with sauce and more Parmesan.","Bake for 30 minutes, or till golden. "]},{"_id":"5c16dae4c1941d50c6ae0f09","category":"Pasta","name":"Casarecce with broccoli & anchovies","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46257669.jpg?tr=w-430","https://www.goodfood.com.au/content/dam/images/3/c/0/t/8/image.related.articleLeadwide.620x349.29w5v.png/1481680833500.jpg","https://img.taste.com.au/nm7RfyQj/taste/2016/11/broccoli-chilli-and-anchovy-pasta-87857-1.jpeg"],"ingredients":["450 g broccoli","1 clove of garlic","1 fresh red chilli","40 g breadcrumbs","3 salted anchovies (or 6 anchovies in oil)","1 tablespoon garlic oil","4 tablespoons olive oil","50 g pine nuts","30 g sultanas","400 g dried casarecce or penne","60 each of fresh and aged caciocavallo (or pecorino) cheese"],"method":["Break the broccoli into florets, peel and finely chop the garlic and deseed and finely chop the chilli.","Toast the breadcrumbs in a dry pan over a medium heat, until they are quite a dark golden brown. Take care not to burn them.","If using salted anchovies, rinse and dry them. Run your thumb gently along the backbone to release it, and you should be able to easily pull it out. If using anchovies in oil, drain them.","Bring a large pan of salted water to the boil, put in the broccoli and cook until just tender. Lift out (retaining the cooking water for the pasta), and put into some iced water to stop the cooking and keep the bright green colour. Drain the broccoli from its iced water and pat dry.","Heat the garlic oil in a pan, add the anchovies and stir with a wooden spoon to ‘melt’ them, taking care not to let them burn. Add the toasted crumbs and set aside.","Heat the olive oil in a large pan and add the garlic, chilli and broccoli, and stir until heated through. Season, add the pine nuts and sultanas, and cook for a few more minutes.","Meanwhile, bring the broccoli’s cooking water back to the boil, add the pasta and cook for about a minute less than the time given on the packet.","Drain, reserving some of the cooking water, and add to the pan of broccoli, tossing together well for another minute and adding a little cooking water to loosen.","Grate and scatter over the two cheeses, along with the reserved anchovies and the breadcrumbs. "]},{"_id":"5c16dbbdc1941d50c6ae0f0a","category":"Pasta","name":"Spinach & ricotta cannelloni","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1185_6_1438682392.jpg?tr=w-430","http://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/food/2015/03/20/70288cce2cfc442480b7fabd0f121438/wholemeal-spinach-and-ricotta-cannelloni.jpg","https://www.recipes.co.nz/ic/1663375784/Baked-Lamb-%26-Rosemary-Cannelloni_2.1.1.jpg"],"ingredients":["400 g spinach","extra-virgin olive oil","¼ teaspoon ground nutmeg","1 onion","2 cloves of garlic","2 x 400 g tins of quality plum tomatoes","1 bay leaf","½ a bunch of fresh basil , (15g)","½ a lemon","1 large free-range egg","Parmesan cheese","250 g ricotta","150 g cannelloni , about 14 tubes","2 x 125 g mozzarella balls"],"method":["Preheat the oven to 180°C,350°F,gas 4. Put the spinach and a drizzle of olive oil in a large pan over a low heat. Add the nutmeg, season with sea salt and black pepper, cover and leave to sweat. Help the kids to stir it occasionally until the spinach has cooked down. Place in a bowl and set to one side to cool a little.","Dice the onion and squash the garlic. In the same pan, heat a drizzle of olive oil and gently sweat the onion until soft.","Scrunch in the tomatoes through your clean hands and add the garlic and bay leaf. Pick in a few basil leaves and grate in the zest of the lemon half, then let it gently simmer for 20 minutes until the sauce has thickened. Season with salt and pepper.","Have the kids squeeze the moisture out of the spinach into the bowl. Place the spinach on a board so you can chop it up. Return the spinach to the liquid in the bowl.","Beat the egg and grate 2 teaspoons of Parmesan cheese. Get the kids to stir the ricotta, egg and Parmesan into the spinach. Season to taste.","Sit a piping bag in a jug, fold its edges over the rim, then spoon in the spinach mixture. Have the kids help pipe the mixture into the cannelloni tubes and lay them in a 20cm x 25cm oven dish. "]},{"_id":"5c16dc84c1941d50c6ae0f0b","category":"Pasta","name":"Pasta peperonata","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/382_1_1438867908.jpg?tr=w-430","https://blog.giallozafferano.it/dulcisinforno/wp-content/uploads/2018/03/9983-Mod.jpg","https://www.lospicchiodaglio.it/img/ricette/pastapeperonata.jpg"],"ingredients":["2 red peppers","2 yellow peppers","extra virgin olive oil","2 red onions","2 cloves of garlic","2 handfuls of fresh flat-leaf parsley","2 tablespoons red wine vinegar or balsamic vinegar","2 handfuls of Parmesan cheese","2 heaped tablespoons mascarpone cheese or crème fraîche , optional","455 g rigatoni, penne or spaghetti "],"method":["Deseed and slice the peppers and put them in a large frying pan over a medium heat with a little olive oil and a pinch of sea salt and black pepper. Place a lid on, and cook slowly for 15 minutes until softened. Don't rush this too much, as cooking the peppers slowly like this really helps to bring out the flavour.","While the peppers are cooking, peel and finely slice the onion, and peel and grate the garlic. Finely chop the parsley leaves and reserve the stalks.","Add the onion to the pan and cook for a further 20 minutes. Then add the garlic and parsley stalks and toss around, keeping everything moving in the pan. Cook for about 3 minutes most. Have a little taste, and season with a bit more salt and pepper. Add the vinegar – it will sizzle away, so give everything a good toss.","Grate the Parmesan and add one handful of the Parmesan and the mascarpone or crème fraîche, if using, and turn the heat down to minimum while you cook the pasta.","Meanwhile, put a large pot of salted water on to boil. Add the pasta to the boiling water and cook according to the packet instructions. When cooked, drain in a colander, reserving some of the cooking water.","Put the peppers, pasta and parsley leaves into a large warmed bowl. Give them a good toss together, then add a little of the pasta cooking water and a few good lugs of extra virgin olive oil to coat the pasta nicely. Serve straight away sprinkled with the rest of the Parmesan. "]},{"_id":"5c16dd4bc1941d50c6ae0f0c","category":"Pasta","name":"Spicy sausage fusilli","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/422_1_1439304800.jpg?tr=w-430","http://saltandwind.com/media/_versions/recipes/fusilli-sausage-pasta-recipe_h_large.jpg","http://www.simplehealthykitchen.com/wp-content/uploads/2014/10/spicy-sausage-and-spinach-skillet-pasta_.jpg","http://sliceofkitchenlife.com/wp-content/uploads/2015/09/spicy-chorizo-and-red-pepper-pasta-5.jpg","https://www.readyseteat.com/sites/g/files/qyyrlu501/files/uploadedImages/img_7397_7019.jpg"],"ingredients":["2 dried red chillies","2 heaped teaspoons fennel seeds","olive oil","600 g quality Italian sausages, Cumberland sausages or higher-welfare pork mince","1 tablespoon dried oregano","250 ml white wine","1 lemon","500 g fusilli or penne","20 g Parmesan cheese , plus extra for serving","½ a bunch of fresh flat-leaf parsley (15g)"],"method":["Crumble the chillies into a pestle and mortar, then bash with the fennel seeds until coarsely crushed. Put to one side.","Heat a lug of olive oil in a heavy-bottomed frying pan over a high heat. Squeeze the meat out of the sausage skins or add the pork mince to the pan, really breaking it up with the back of a wooden spoon. Fry for a few minutes, or until the meat starts to colour and the fat has rendered slightly, then push it down once more so it resembles coarse mince.","Add the bashed-up fennel seeds and chillies and cook over a medium heat for around 10 minutes, or until the meat becomes crisp, golden brown and slightly caramelised.","Stir in the oregano, then pour in the white wine and allow it to reduce by half. Finely grate over the zest of 1 lemon, then squeeze over the juice and turn the heat down to low.","Meanwhile, cook the pasta in a large pan of salted boiling water according to the packet instructions.","When the pasta has cooked but still has a bit of bite, drain it in a colander, reserving a mugful of the cooking water. Add the pasta to the meat pan, then toss to coat in all those lovely flavours, loosening with a good splash of the reserved cooking water, if needed.","Grate in the Parmesan, then pick, roughly chop and add the parsley leaves. Taste and check the seasoning, then serve immediately with a little extra grated Parmesan sprinkled over the top.","JAMIE’S TOP TIP Remember to buy the best sausages you can afford – if you get cheap, dodgy sausages it just won’t work."]},{"_id":"5c16ddb0c1941d50c6ae0f0d","category":"Pasta","name":"Mini shell pasta with a creamy smoked bacon & pea sauce","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/341_1_1436866576.jpg?tr=w-430","https://static01.nyt.com/images/2015/11/19/dining/19COOKING-MINISHELLPASTA/19COOKING-MINISHELLPASTA-articleLarge.jpg","https://www.simplyhappyfoodie.com/wp-content/uploads/2017/12/Instant-pot-creamy-garlic-tuscan-chicken-pasta-2.jpg","https://www.scatteredthoughtsofacraftymom.com/wp-content/uploads/2018/06/Summer-Picnic-Pasta-Salad.jpg"],"ingredients":["6 slices higher-welfare smoked streaky bacon or pancetta","1 small bunch fresh mint","100 g Parmesan cheese","1 organic chicken stock cube , optional","400 g dried mini shell pasta","olive oil","300 g frozen peas","2 heaped dessertspoons half-fat crème fraîche","1 lemon"],"method":["Finely slice the bacon. Pick the mint leaves and discard the stalks. Finely grate the Parmesan. Bring a large pan of salted water to the boil and drop in the stock cube (if using). Stir until it’s dissolved, then add the mini shells and cook according to the packet instructions. Get a large frying pan over a medium heat and add a good lug of olive oil. Add the bacon to the pan, sprinkle a little pepper over and fry until golden and crisp.","Meanwhile, finely chop your mint leaves. As soon as the bacon is golden, add your frozen peas and give the pan a good shake. After a minute or so, add the crème fraîche and chopped mint to the bacon and peas. Drain the pasta in a colander over a large bowl, reserving some of the cooking water.","Add the pasta to the frying pan. Halve your lemon and squeeze the juice over the pasta. When it’s all bubbling away nicely, remove from the heat. The sauce should be creamy and delicious but if it’s too thick for you, add a splash of the reserved cooking water to thin it out a bit. Add the grated Parmesan and give the pan a shake to mix it in.","Divide your pasta between plates or bowls, or put it on the table in a large serving dish and let everyone help themselves. Lovely with a simply dressed green salad. "]}]},{"_id":"5c2134a139e4331e826db0fc","category":"Rice","image":"https://www.soscuisine.com/media/images/recettes/very_large/2887.jpg","recipes":[{"_id":"5c16e71ac1941d50c6ae0f18","category":"Rice","name":"Aubergine daal","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1082_1_1396365574.jpg?tr=w-430","https://www.hollandandbarrett.com/the-health-hub/wp-content/uploads/2016/10/am_ff_occasion_1dhal-500x345.jpg","http://itsaplantbasedlife.com/wp-content/uploads/2017/05/DSC_0037-e1495649277165.jpg","http://makingthymeforhealth.com/wp-content/uploads/2016/04/One-Pot-Spinach-Dal.jpg"],"ingredients":["1 large aubergine","2 red onions","4 cloves of garlic","10 cm piece of ginger","4 tablespoons rogan josh curry paste","groundnut oil","500 g yellow split peas","1 vegetable stock cube","250 g wholemeal flour , plus extra for dusting","2 tablespoons olive oil","320 g basmati rice","1 fresh red chilli","1 handful of fresh curry leaves","1 teaspoon mustard seeds"],"method":["Preheat the oven to 180°C,350°F,gas 4.","Cut the aubergine into 2cm chunks, peel and slice the onions and garlic, peel and finely grate the ginger.","Put all this into a large high-sided roasting tray with the curry paste and a lug of groundnut oil. Toss together until well coated, then roast for 20 to 25 minutes, or until sticky and caramelized.","Remove half the roasted veg to a large pan to start your daal and return the tray to the oven to keep warm – turn the oven off so that the veg don’t dry out.","Place the pan on a low heat on the hob. Stir in the split peas, crumble in the stock cube and add 2 litres of boiling water.","Simmer for around 1 hour 20 minutes with the lid on, or until the split peas are tender and the daal has thickened, stirring occasionally, and adding splashes of water to loosen, if needed.","Meanwhile, place the flour in a large bowl with a pinch of sea salt and make a well in the middle. Add 2 tablespoons of olive oil and 150ml of water to the well and mix together with a fork."]},{"_id":"5c16e79ec1941d50c6ae0f19","category":"Rice","name":"All-in-one rice & chicken","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46262522.jpg?tr=w-430","https://images.britcdn.com/wp-content/uploads/2016/11/brazillian-645x783.jpg?w=1000&auto=format","https://i0.wp.com/www.evseats.com/wp-content/uploads/2016/09/One-Pot-Middle-Eastern-Chicken-and-Rice-4.jpg?resize=1080%2C1350","https://www.lecremedelacrumb.com/wp-content/uploads/2017/05/one-pan-spanish-chicken-rice-106.jpg","https://www.isabeleats.com/wp-content/uploads/2018/09/mexican-chicken-and-rice-small-1.jpg"],"ingredients":["olive oil","2 free-range chicken thighs","2 free-range chicken legs","1 onion","1 clove of garlic","2 teaspoons ground coriander","1 heaped teaspoon ground cumin","250 g long-grain rice","150 g Medjool dates","1 tablespoon runny honey","a few sprigs of fresh coriander"],"method":["Heat a splash of oil in a pan and brown the chicken legs and thighs all over, then remove to a plate.","Peel and dice the onion then in the same pan, sweat the onion until softened, before crushing in the garlic and adding the spices.","Allow to cook for about 2 minutes, then stir in the rice, dates, honey and browned chicken.","Cover with water and bring to the boil before allowing to simmer, covered, over a medium heat for 30 minutes, or until the rice and chicken are cooked through.","Season to taste with sea salt and black pepper, then pick, roughly chop and scatter over the coriander leaves, to serve."]},{"_id":"5c16e86cc1941d50c6ae0f1a","category":"Rice","name":"Grilled mushroom risotto","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/255_1_1436800586.jpg?tr=w-430","https://img.taste.com.au/6s3NJklZ/taste/2016/11/grilled-chicken-zucchini-and-mushroom-risotto-32627-1.jpeg","https://img.taste.com.au/Irfnc099/taste/2016/11/baked-mushroom-risotto-74528-1.jpeg","https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTFVCDAF3C4VIY8Z26eSJUaP7gcoHR8oGqug9GedOMbjGNizkOS"],"ingredients":["1 small onion , peeled and finely chopped","2 sticks celery , trimmed and finely chopped","400 g risotto rice","75 ml vermouth or white wine","sea salt","freshly ground black pepper","4 large handfuls wild mushrooms (try shiitake, girolle, chestnut or oyster) , cleaned and sliced"],"method":["A mushroom risotto can be taken in many different ways, depending on what kind of mushrooms you have and whether they are introduced at the very beginning of cooking or just added at the end, as I’m going to do here. The inspiration for this recipe came when I was in Japan and saw mushrooms being cooked completely dry on a barbecue or griddle pan. This way of cooking brings out a really fresh and nutty flavour in them; perfect for being dressed lightly with olive oil, salt and lemon juice or stirred into a risotto at the last minute before serving.","Heat your stock in a saucepan and keep it on a low simmer. Place the porcini mushrooms in a bowl and pour in just enough hot stock to cover. Leave for a couple of minutes until they’ve softened. Fish them out of the stock and chop them, reserving the soaking liquid.","In a large pan, heat a lug of olive oil and add the onion and celery. Slowly fry without colouring them for at least 10 minutes, then turn the heat up and add the rice. Give it a stir. Stir in the vermouth or wine – it’ll smell fantastic! Keep stirring until the liquid has cooked into the rice. Now pour the porcini soaking liquid through a sieve into the pan and add the chopped porcini, a good pinch of salt and your first ladle of hot stock. Turn the heat down to a simmer and keep adding ladlefuls of stock, stirring and massaging the starch out of the rice, allowing each ladleful to be absorbed before adding the next.","Carry on adding stock until the rice is soft but with a slight bite. This will take about 30 minutes. Meanwhile, get a dry griddle pan hot and grill the wild mushrooms until soft. If your pan isn’t big enough, do this in batches. Put them into a bowl and add the chopped herbs, a pinch of salt and the lemon juice. Using your hands, get stuck in and toss everything together – this is going to be incredible!"]},{"_id":"5c16e8ecc1941d50c6ae0f1b","category":"Rice","name":"Spicy pangrattato risotto","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/529_1_1438963214.jpg?tr=w-430","https://kitchenrescue.tv/wp-content/uploads/2017/10/salmon-risotto-600-600-min.png","https://i2.wp.com/farm1.static.flickr.com/125/358492735_129e3d977e.jpg","https://resources.stuff.co.nz/content/dam/images/1/j/7/u/5/r/image.related.StuffLandscapeSixteenByNine.620x349.1j7srh.png/1495140997353.jpg","https://static1.squarespace.com/static/543dc236e4b0fffb45747ede/t/5549a455e4b015b5435ebb58/1430889585325/"],"ingredients":["3 dried bird's-eye chillies","1 lemon , zest of","4 cloves garlic , peeled","½ large loaf ciabatta , stale if possible, cut into chunks","6 good-quality salted anchovy fillets in oil","olive oil","1 basic risotto recipe","700 ml organic vegetable or chicken stock , hot","50 g butter"],"method":["Whiz the lemon zest, dried chillies, garlic, anchovies and bread chunks in a food processor with a bit of oil from the anchovy tin until the mixture looks like breadcrumbs. Heat a large frying pan and add a splash of olive oil. Fry the breadcrumbs in the oil until darkened and crisp, then drain them on a piece of kitchen paper and allow to cool.","Make your basic risotto recipe. Place a large saucepan on a medium to high heat and pour in half the stock, followed by all your risotto base. Stirring all the time, gently bring to the boil, turn the heat down and simmer until almost all the stock has been absorbed. Add the rest of the stock a ladleful at a time until the rice is cooked. You might not need all your stock. Be careful not to overcook the rice – check it throughout cooking to make sure it’s a pleasure to eat. It should hold its shape but be soft, creamy and oozy. And the overall texture should be slightly looser than you think you want it.","Turn off the heat, beat in your butter and Parmesan, check the seasoning and add a little salt and pepper if needed. Don’t be too generous with the salt because the pangrattato has salt in it too and you don’t want to overdo it!","Place a lid on the pan and leave the risotto to rest for a minute. You can now take the pan to the table so that everyone can help themselves, or divide the risotto between individual serving plates and sprinkle the pangrattato over the top. Place a block of Parmesan on the table with a grater and tuck in. "]},{"_id":"5c16e9b8c1941d50c6ae0f1c","category":"Rice","name":"Sushi rolls","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/4CdRkr6f4fVBE5zqqmUIcT.jpg?tr=w-430","https://cdn-image.foodandwine.com/sites/default/files/styles/medium_2x/public/201103-xl-sushi-rolls.jpg?itok=pLpBzXGi","https://veganheaven.org/wp-content/uploads/2018/08/Vegan-Sushi-31-500x375.jpg","https://howdaily.com/wp-content/uploads/2017/05/zushi-sushi-800x533.jpg?x14878","https://barriobellasartes.cl/wp-content/uploads/sushi-lead.jpg","http://upload.wikimedia.org/wikipedia/commons/6/65/Assortment_of_sushi,_May_2010.jpg","https://www.miamismith.com/sites/default/files/images/articles/9993.jpg"],"ingredients":["200 g sushi rice","1 tablespoon rice vinegar","2 sheets of nori","¼ of a cucumber","¼ of a red pepper","½ a carrot","½ a small ripe avocado"],"method":["Put the rice in a small saucepan with 375ml water, leave to soak for 30 minutes, then bring to the boil.","Put the lid on and simmer gently for 10 minutes, until the water has been absorbed by the rice.","In a bowl, dissolve the sugar in the vinegar, then sprinkle over the rice mix, combining with a rubber spatula so as not to break up the rice.","Allow to cool for 20 minutes before using.","Deseed or peel the vegetables, then cut into fine strips or batons.","Place a sheet of nori on a bamboo sushi mat, then spread half the rice over the sheet except for 1cm clear at the top.","Add some vegetables in a horizontal line across the rice.","Begin rolling the mat from the near edge, keeping the filling in place with your fingers. Roll firmly but not too hard.","Remove the roll from the mat and cut into 6 or 8 pieces. Repeat with second piece of nori. "]},{"_id":"5c16ea57c1941d50c6ae0f1d","category":"Rice","name":"Ashley's sticky rice mango","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46263590.jpg?tr=w-430","https://img-global.cpcdn.com/003_recipes/5293a9862e6cd153/751x532cq70/photo.jpg","https://www.mysagegourmet.com/wp-content/uploads/2015/10/Mango-Sticky-Rice.png","https://thebakermama.com/wp-content/uploads/2015/07/IMG_2708-680x900.jpg"],"ingredients":["400 g sushi rice or Thai sticky rice","1 x 400 ml tin of coconut milk","100 g palm sugar or brown sugar","2 large ripe mangos"],"method":["Soak the rice in cold water and leave overnight.","The next day, rinse and drain the rice, repeating until the water runs clear.","Place it in a pan, cover with cold water and pop on the lid. Bring to a rolling boil, then simmer over a low heat for 5 minutes, or until all the water is absorbed.","In another pan, stir the coconut milk, sugar and ¼ teaspoon of salt over a medium heat. Bring it to the boil, then take off the heat.","Pour half over the rice and leave to absorb for about 2 minutes, or until the rice is soft. Pour the rest into a bowl. Chill both in the fridge.","Fold the coconut milk through the rice, then peel, destone and cut the mango into wedges. Serve with the sticky rice."]},{"_id":"5c16eba4c1941d50c6ae0f1e","category":"Rice","name":"Oozy courgette risotto","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46337890.jpg?tr=w-430","https://i0.wp.com/www.strandsofmylife.com/wp-content/uploads/2012/07/Oozy-Mushroom-Risotto-600-post.jpg?fit=600%2C402&ssl=1","https://img.taste.com.au/ghsl84kL/taste/2016/11/oven-baked-mushroom-risotto-82384-1.jpeg","http://cdn.recipes100.com/v/9c47b246b663c7e3756bdee18e916dbe.jpg","https://flockler.com/thumbs/sites/192/stilton-risotto-with-sausage-spring-greens_s640x0_c1886x1101_l0x979_q70_noupscale.jpg"],"ingredients":["1 large onion","1 large clove of garlic","2 sticks of celery","1 knob of unsalted butter","olive oil","2 small courgettes (300g)","800 ml organic vegetable stock","1 bunch of fresh basil","40 g Italian hard cheese","300 g arborio rice","200 ml white wine , optional","1 fresh red chilli","2 x 125 g balls of buffalo mozzarella"],"method":["Peel the onion and garlic, trim the celery and finely chop all three. Place a large saucepan over a medium-low heat.","Place the butter in the hot pan with the onion, garlic and celery, a splash of oil, and a splash of water. Reduce the heat to low and cook for around 5 minutes, or until softened, stirring occasionally.","Trim the courgettes, slice lengthways into quarters, then chop into small ½cm chunks and put to one side.","Fill a medium saucepan with 800ml water. Add the stock cube and bring to the boil over a high heat, stirring to dissolve, then turn the heat down to low.","Pick and reserve the basil leaves, then add the stalks to the pan of stock. Finely grate the Italian hard cheese.","Once the vegetables are very soft but not browned, add the rice to the pan.","Stir and fry the rice for 1 minute until translucent, then add the wine (if using) and keep stirring until it has been absorbed by the rice. "]},{"_id":"5c16ec50c1941d50c6ae0f1f","category":"Rice","name":"Rice & peas with jerk roasted veg","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46260491.jpg?tr=w-430","https://mk0wishfulchefg65d1r.kinstacdn.com/wp-content/uploads/2013/01/CaribbeanJerkChicken.jpg","https://thecookreport.co.uk/wp-content/uploads/2018/08/Jerk-chicken-pinterest-1.jpg","https://www.plated.com/uploads/culinary/recipe_image/file/25679/hero_Jerk_Chicken_with_Coconut_Rice_and_Summer_Vegetables___HERO.jpg","https://healthiersteps.com/wp-content/uploads/2017/02/jamaican-jerk-cauliflower-1.jpg"],"ingredients":["125 g dried red kidney beans , or 1 x 400g tin of kidney beans","2 cloves of garlic","a few sprigs of thyme","2 spring onions","½ teaspoon allspice berries","1 stick of cinamon","100 g block of coconut cream","1 scotch bonnet chilli"],"method":["If using dried beans, soak them overnight.","To make the jerk marinade, trim and roughly chop the spring onions, and pick the thyme leaves, then blitz all the ingredients in a blender with a splash of oil until you have a lovely smooth sauce – loosen with a splash more oil, if needed.","For the roasted veg, quarter and deseed the squashes and peppers, slice the okra in half diagonally and trim the spring onions. Toss in the marinade, with the unpeeled garlic, then leave to marinate for at least 2 hours.","Next, prepare the beans. If using soaked beans, drain, then boil them in a large pan of fresh cold water with the garlic, spring onions (bash before adding), the thyme, allspice and cinnamon until soft and tender, for about 1½ hours","Grate and stir in the coconut cream, then prick and add the scotch bonnet chilli, and simmer for 10 minutes. Add the rice and cook for 25 to 30 minutes, or until soft, adding extra splashes of water, if needed."]},{"_id":"5c16ecfdc1941d50c6ae0f20","category":"Rice","name":"Sweet vanilla risotto with poached peaches and chocolate","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/587_1_1421662231.jpg?tr=w-430","https://crushmag-online.com/wp-content/uploads/2012/08/Risoo07.jpg","https://cdn.cpnscdn.com/static.coupons.com/ext/kitchme/images/recipes/600x400/butternut-squash-and-vanilla-risotto_6642.jpg","https://www.pineappleandcoconut.com/wp-content/uploads/2015/05/Vanilla-Scallops-Coconut-Risotto-916.jpg","https://theveganpantry.com.au/wp-content/uploads/2015/04/Vanilla-Bean-Risotto-with-White-Peaches-800x500.jpg"],"ingredients":["6 ripe peaches , halved","6 tablespoons caster sugar","½ stick cinnamon","1 orange , zest and juice of","3 tablespoons butter","2 vanilla pods","325 g risotto rice","1 wineglass white wine","1 litre full fat milk , preferably organic"],"method":["When you halve the peaches, leave the stones in – they will come away a lot more easily after they have been cooked. Put them into a small pan with 4 tablespoons of the sugar, the cinnamon stick and the zest and juice of the orange. Put a lid on top and slowly simmer for about 10 to 15 minutes, until the peach skin and stones can be easily removed. You don't want to cook them to pulp – they should be soft but should still hold their shape. Remove from the heat and put to one side.","In an appropriately sized high-sided, thick-bottomed pan with a lid, slowly melt two-thirds of the butter. Score down the length of the vanilla pods and remove the seeds by scraping a knife down the inside of each half. Add the seeds to the butter and stir. Continue to cook for 1 minute before adding your rice with the remaining sugar. Turn the heat up to medium, stir the rice, and add the wine, continuing to stir until it has almost cooked away. Now add the milk little by little. Keep the rice on a slow but constant simmer for about 16 or 17 minutes and stir it as often as you can. In this way you can massage the starch out of the rice and this will give you a silky, oozy end product, much like the classic Italian risotto. When the rice has cooked through it should be soft yet still holding its shape. You may need to add a little more milk or water just to adjust the consistency. Remove from the heat, add the grated white chocolate and the rest of the butter, then stir, place a lid on top and leave for a few minutes.","Remove the skin and stones from the peaches, discard them along with the cinnamon stick, and take the peaches to the table with your block of dark chocolate, snapped into small pieces. Spoon the risotto on to plates, then push a couple of pieces of dark chocolate into the middle of each one. Just so you know, a perfect risotto should slowly creep and ooze to the side of your plate, so don't worry if it starts to spread out! Gently tear the peaches and place some on each plate, then drizzle over some of the lovely juice and sprinkle over a few mint leaves. By the time you go to eat it, the dark chocolate will have melted. Joy joy joy! "]},{"_id":"5c16ee2fc1941d50c6ae0f21","category":"Rice","name":"Red mullet with jewelled wild rice","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46261457.jpg?tr=w-430","https://img.delicious.com.au/1ElT5mmh/h480-w720-cfill/del/2016/04/red-mullet-with-jewelled-wild-rice-28791-1.jpg","https://cdn.jamieoliver.com/recipe-database/oldImages/xtra_med/440_1_1350905376.jpg","https://cdn.jamieoliver.com/recipe-database/xtra_med/81402378.jpg"],"ingredients":["4 x 250g whole red mullet, scaled and gutted, from sustainable sources","½ a bunch of fresh lemon thyme","4 slices of higher-welfare thin-cut smoked pancetta","olive oil","300g mixed wild rice","1 pomegranate","½ a bunch of fresh mint","½ a bunch of fresh flat-leaf parsley","1 lemon","extra virgin olive oil"],"method":["Start by preparing your jewelled wild rice. Cook the rice according to the packet instructions, then drain and rinse under cold water. Set aside while you work on your fish.","Preheat the oven to 220ºC,425ºF,gas 7. Slash the mullet skin three to four times (don’t cut too far into the flesh). Pop a few sprigs of lemon thyme into each cavity and season well.","Wrap the head of each fish in a slice of pancetta and drizzle with a little olive oil. Pop the fish on a large roasting tin and roast for 12 minutes, or until cooked through.","Meanwhile, make your tapenade. Drain and soak the olives in a bowl of cold water for 5 minutes. Drain well, then remove the stones.","Peel the garlic, then bash in a pestle and mortar with the dried chilli flakes and fennel seeds until fine. Tip into a bowl.","Roughly chop the almonds, olives and sundried tomato and add to the bowl, followed by the spice mix and extra virgin olive oil.","Tip the rice into a large bowl. Halve and bash the pomegranate with a spoon so the seeds fall into the bowl.","Pick, chop and add the mint and parsley leaves along with the lemon zest and a squeeze of juice. Drizzle with extra virgin olive oil and season with a pinch of sea salt and black pepper. Mix well.","When the fish is cooked, remove it from the oven and leave to rest for 2 minutes. "]}]},{"_id":"5c21358f9f16651fa7a17afc","category":"Salmon","image":"http://www.lazezh.com/uploads/jpg/lazezh_52f30fce5d.jpg","recipes":[{"_id":"5c16f5c0c1941d50c6ae0f2c","category":"Salmon","name":"Crispy fried salmon with spring vegetable broth","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/163_1_1438935981.jpg?tr=w-430","https://i.pinimg.com/236x/cc/a5/30/cca5300807ebdd96c0fba2b1d2318d26--tuna-recipes-asian-recipes.jpg","https://food.fnr.sndimg.com/content/dam/images/food/fullset/2007/2/2/0/ei0915_salmon.jpg.rend.hgtvcom.826.620.suffix/1384886712165.jpeg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/grilled-miso-salmon-with-rice-noodles.jpg?itok=Ohu7SN-Y","https://www.simplyrecipes.com/wp-content/uploads/2012/03/salmon-lemon-cream-sauce-horiz-a-1600.jpg","https://www.diversivore.com/wp-content/uploads/2016/10/Honey-Dijon-Baked-Salmon-banner.jpg","https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fcdn-image.foodandwine.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2Fsoy-and-ginger-glazed-salmon-with-udon-noodles.jpg%3Fitok%3DSl3hadnw&w=1000&c=sc&poi=face&q=70","https://s3.amazonaws.com/finecooking.s3.tauntonclud.com/app/uploads/2017/04/18171912/Ripert-Seared-Salmon-main.jpg"],"ingredients":["850 ml organic chicken or vegetable stock , lightly seasoned","8 baby bulbs fennel , stalks removed and herby tops reserved","4x120 g salmon steaks , from sustainable sources, ask your fishmonger, scored","1 small handful fresh basil , leaves picked","1 small handful fresh mint , ripped","extra virgin olive oil","sea salt","freshly ground black pepper","100 g green beans , tops removed"],"method":["There's nothing like a piece of perfectly cooked salmon with a crispy, crunchy skin, perfectly complemented by a spring veg broth. In the markets and supermarkets these days you can get some fantastic spring vegetables: baby carrots with tops, baby fennel with its herby leaves, baby turnips, peas and broad beans, fine green and yellow French beans, all really colourful and easy to cook with. Here's a nice little combination – it's all cooked in the same pot and gives you a lovely broth. The only thing you have to do is control the cooking times by adding the veg that need longer in the pot first.","First, make the aioli. When you've done that, bring your stock to the boil in a large pan then add your fennel and allow this to boil for 4 minutes while you heat up a non-stick frying pan. Take your salmon steaks and, if you fancy it, you could finely slice a little of your mint and basil and push this into the score marks. Pat the salmon steaks with a little olive oil, season and place skin-side down in the frying pan. Leave them for 2 minutes to get really crispy then check how they're doing. They'll want around 4 minutes on the skin side and 1 minute on the other. You'll get an idea of how they're cooking as you'll see the salmon change colour.","When the fennel has had 4 minutes, add the green beans and the broad beans. Give them a further 2 minutes. By this time you will probably want to turn over the salmon steaks for their last minute. Add the peas to the other veg and cook for a final 2 minutes. Don't be tempted to overcook the salmon – remove it from the heat. Divide the vegetables between 4 bowls, rip over the mint and basil, ladle over some of your hot cooking stock and place the salmon on top. Serve with a dollop of aïoli. Fantastic! "]},{"_id":"5c16f646c1941d50c6ae0f2d","category":"Salmon","name":"Pan-roasted salmon with purple sprouting broccoli and anchovy-rosemary sauce","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/375_1_1438763662.jpg?tr=w-430","https://westillcook.files.wordpress.com/2014/09/p9210001.jpg","https://www.deliciousmagazine.co.uk/wp-content/uploads/2018/07/799715-1-eng-GB_winter-panzanella-with-chilli-broccoli-and-anchovies-768x960.jpg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/01/sesame-salmon-and-purple-broccoli.jpg?itok=QBMqZI7b","http://www.andyboy.com/wp-content/uploads/2017/08/Chili-Salmon-Bowls-20-1.jpg"],"ingredients":["1 sprig fresh rosemary , leaves picked and very finely chopped","10 good-quality anchovy fillets in oil , drained and roughly chopped","1 lemon , juice of","extra virgin olive oil","freshly ground black pepper","4 x 200 g salmon fillets , from sustainable sources, ask your fishmonger, pinboned","olive oil","sea salt","freshly ground black pepper","500 g purple sprouting broccoli"],"method":["Preheat your oven to 200ºC,400ºF,gas 6, then make your anchovy-rosemary sauce. Pound the rosemary in a pestle and mortar until you have a paste. Add the anchovy fillets and pound again until the paste is dark green. Now add the lemon juice, a couple of lugs of olive oil and some pepper, and mix together until you have a sauce with a good drizzling consistency.","Get a large, ovenproof, non-stick frying pan hot. Pat the salmon fillets with a little olive oil, season them with salt and pepper and cook them in the pan, skin-side down, for 2 minutes. Flip them over, then place the pan in the preheated oven for another 3 to 4 minutes, depending on the thickness of the fillets and the way they’ve been sliced.","Just after the salmon goes into the oven, put your broccoli into some boiling, salted water for 3 to 4 minutes until perfectly cooked.","To check if the fish is cooked all the way through, you can pull the fillets apart a little bit and look inside. Salmon goes from being an orangey colour to an opaque pink, so that’s what you’re looking for. Please do not overcook them, because, as simple as this dish sounds, it’s your mission to ‘just’ cook the fish so you’re rewarded with a soft inside and a slightly crispy outside – heaven!","When the broccoli’s perfectly done, drain it, toss it in a little of the anchovy-rosemary sauce and divide it between your plates. Place a salmon fillet on top of each and drizzle with some more sauce. "]},{"_id":"5c16f6b1c1941d50c6ae0f2e","category":"Salmon","name":"Marinated and grilled salmon","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/4fcD7lM6a5AAuwjcDpeR9e.jpg?tr=w-430","http://thekeenancookbook.com/wp-content/uploads/2012/08/grilled-marinated-salmon-1.jpg","https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR12D1AJZjs0LvdOpBsTx3D7Rb9PM4NQxza7IGhEMlraGl6QAap","https://img.buzzfeed.com/video-api-prod/assets/04ff8cfcc4b5428a8bcc6b03099d4492/Thumb_A_FB.jpg","https://foodsogoodmall.com/wp-content/uploads/2013/10/Soy-Broiled-Salmon-Steaks.jpg"],"ingredients":["2 sticks fresh lemon grass","½ small bottle low-salt dark soy sauce","1 bunch fresh coriander , stalks finely sliced, leaves reserved","1 thumb-sized piece fresh ginger , finely grated","4 cloves garlic , finely grated","1 large salmon fillet , (about 1kg), from sustainable sources, ask your fishmonger, scaled and pin-boned","4 tablespoons runny honey","2 red chillies , deseeded and finely sliced","4 spring onions , finely sliced","2 limes"],"method":["Bash up your lemon grass and mix it with the soy sauce, coriander stalks, ginger and garlic then rub all over the salmon fillet. Leave it to marinate for an hour or so, either in a plastic bag or on a tray covered with cling film.","Preheat your grill to its highest setting. When you’re ready to cook the salmon, remove it from the marinade, brush with honey and grill for 10 minutes.","Fork up the cooked salmon a little so everyone can see the lovely, dark, sticky outside and the juicy, pink fish underneath. Serve sprinkled with the chillies, spring onions, reserved coriander leaves, then squeeze over the lime. "]},{"_id":"5c16f70dc1941d50c6ae0f2f","category":"Salmon","name":"Simple baked salmon with dill yoghurt","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/775_1_1436781208.jpg?tr=w-430","https://greatist.com/sites/default/files/styles/fb-1200x630/public/wp-content/uploads/2012/09/Oven-Baked-Salmon_Kelli-Dunn_featured.jpg?itok=QWc3DyBA","https://www.seriouseats.com/recipes/images/2017/05/20170420-baked-salmon-harissa-lime-aioli-vicky-wasik-10.jpg","https://images-gmi-pmc.edge-generalmills.com/e08ec0b3-e6d3-4a9c-9d16-ba3d249836b8.jpg","https://assets.epicurious.com/photos/579f8ee8e4857f9f1047d0b1/master/pass/baked-salmon-with-mustard-dill-sauce.jpg","https://gbc-cdn-public-media.azureedge.net/img11724.768x512.jpg"],"ingredients":["3 kg whole salmon , from sustainable sources, ask your fishmonger, scaled, filleted and pin-boned, or use 2x1.2kg sides of salmon fillet","8 sprigs fresh rosemary","extra virgin olive oil","500 g fat free natural yoghurt","1 bunch fresh dill , chopped","1 lemon , juice and zest of"],"method":["This is an easy way of cooking whole salmon fillets. It’s simple to serve and just as good cold as it is hot. If you’re not sure how to prepare the fish, get your fishmonger to do it for you. I’ve cooked it on a wooden plank in my outdoor wood-fired oven, but you can cook it in a large roasting tray in the oven.","Preheat the oven to 200ºC,400ºF,gas 6. Place the salmon fillets skin-side down in a large clean roasting tray – cut each in half if they don’t fit. Lay the rosemary on top and drizzle with olive oil. Gently rub the oil and rosemary all over the fish, and season. Bake for 20 minutes or until just cooked. (Alternatively, place on a clean smooth wooden plank and cook in an outdoor wood-fired oven for 20 minutes.)","Meanwhile, mix the yoghurt and dill with the grated zest of the lemon, a few drops of juice and season. Cut portions of salmon off the skin and serve with the Italian farro salad."]},{"_id":"5c16f88cc1941d50c6ae0f31","category":"Salmon","name":"Whole roasted salmon stuffed with lemon and herbs","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/817_1_1438764480.jpg?tr=w-430","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--212469_11.jpg?itok=mlz39C64","https://be35832fa5168a30acd6-5c7e0f2623ae37b4a933167fe83d71b5.ssl.cf3.rackcdn.com/3443/james-martin-whole-salmon__square.jpg","https://www.savorynothings.com/wp-content/uploads/2017/07/whole-baked-fish-with-lemon-herbs-and-garlic-butter-recipe-image-14.jpg","https://www.goodfood.com.au/content/dam/images/4/3/w/j/f/image.related.articleLeadwide.620x349.43wj3.png/1443998292177.jpg","https://dlife.com/wp-content/uploads/2018/04/Roasted-Whole-Red-Snapper.jpg","https://www.thismamacooks.com/images/2016/04/smoked-lake-trout-4.jpg"],"ingredients":["1 x 2.5 kg whole salmon , scaled, gutted, from sustainable sources","1.5 kg re-skinned potatoes","1 bulb of fennel","olive oil","½ a bunch of fresh dill","½ a bunch of fresh flat-leaf parsley","½ a bunch of fresh tarragon","1 lemons","extra virgin olive oil"],"method":["Preheat the oven to full whack.","Get yourself a large roasting tray that your whole salmon will fit inside – you’ll probably need to lay the fish diagonally across the tray, like I’ve done in the picture –it won’t matter if the head and tail drape over the sides a little.","Scrub the potatoes clean, then slice into ½ cm rounds. Lay them over the base of the tray and season well with sea salt and black pepper. Cut the fennel into six wedges, scatter over the potatoes and give it all a generous drizzle of olive oil.","Pick half the herb leaves onto a chopping board, .finely grate over the lemon zest, then roughly chop everything together. Scrape this mixture into a bowl.","Using a sharp knife, make 6 slashes on each side of the fish, about 2cm deep and at an angle.","Sprinkle salt and pepper into each incision, stuff each with a pinch of the lemon-herb mix, then smooth flat. Drizzle the fish lightly with olive oil, then lay on top of the potatoes and fennel.","Slice up one of the lemons, then stuff into the cavity with the remaining herbs.","To check if the fish is cooked, take a clean skewer and push it into the deepest part of the fish, just behind the head. Count to 10, then carefully take the skewer out and hold it against your top lip –if it’s nice and warm, the fish is cooked."]},{"_id":"5c16f7a2c1941d50c6ae0f30","category":"Salmon","name":"Quick salmon and potato al forno","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/768_1_1436880021.jpg?tr=w-430","https://s3.amazonaws.com/grecipes/public/pictures/recipes/1377425/salmon1.jpg","https://ricette-dukan.com/wp-content/uploads/2016/12/salmone_al-_forno.jpg","https://static.fanpage.it/wp-content/uploads/sites/21/2017/07/salmon-518032-960-720.jpg","https://i.dailymail.co.uk/i/pix/2011/07/29/article-2019751-0D360FAA00000578-309_468x560.jpg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--3010_10.jpg?itok=cODsjKi8"],"ingredients":["600 g waxy new potatoes","1 large bulb fennel","sea salt","freshly ground black pepper","1 bunch fresh flat-leaf parsley , leaves picked and finely chopped","2 cloves garlic , peeled and finely chopped or grated","15 g butter , cut into small pieces","4 x 120 g salmon fillets , from sustainable sources, ask your fishmonger, scaled and pin-boned","olive oil","a few sprigs fresh mint , leaves picked and finely chopped","1 small handful Parmesan cheese , grated","1 lemon , zest of"],"method":["This is a brilliant one-tray dinner. Roasted fennel and potatoes are a magic combination, as are the fresh herbs and salmon. Scoring and stuffing the salmon is a great little trick you can use on any type of fish.","Preheat your oven to 220°C,425°F,gas mark 7. Bring a large pan of salted water to the boil. Halve the potatoes lengthways and trim the fennel bulb, reserving the leafy fronds for garnishing later. Cut the fennel bulb into eight wedges, add these to the salted water with the halved potatoes and parboil for around 6 minutes.","Drain the vegetables in a colander and leave to steam-dry for a minute. Transfer to a large roasting tray and season well with salt and pepper. Sprinkle over half the chopped parsley and all of the garlic, dot over the butter and drizzle well with olive oil. Toss everything together in the roasting tray, then shake it out so it is in one even layer. Cook in the oven for about 30 minutes, or until golden.","While the vegetables are roasting away in the oven, you can start preparing the salmon fillets. Pinch the fillets so they plump up and use the length of a knife to score the skin side of them. You want to score about 1cm down into them. Not only will this help all the lovely flavours get right into the fish, it will also help it cook more quickly. Season both sides of the fish well and stuff the remaining chopped parsley and the mint leaves into the scores. Mint goes brilliantly with oily fish, such as salmon.","Once the potatoes are nice and golden, take them out of the oven and sprinkle the grated Parmesan over them. Give everything a bit of a jiggle, then lay the salmon, skin-side up, on top. Sprinkle the lemon zest over the top, drizzle with olive oil then cook for 15 minutes.","Just before the salmon comes out of the oven, chop the reserved fennel fronds. Sprinkle them over the finished dish, then serve it in the middle of the table with some wedges of lemon and let everyone tuck in."]},{"_id":"5c16f911c1941d50c6ae0f32","category":"Salmon","name":"Salt-crust salmon","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/83619431.jpg?tr=w-430","https://gbc-cdn-public-media.azureedge.net/img21010.768x512.jpg","https://assets.bonappetit.com/photos/57ad2a1b53e63daf11a4dc80/16:9/w_1200,c_limit/salt-baked-salmon-with-citrus-and-herbs.jpg","http://eatinmykitchen.meikepeters.com/wp-content/uploads/2015/12/saltbakedsalmon2.jpg"],"ingredients":["1 x 2 kg whole salmon , gutted, gills removed, scales left on, from sustainable sources","4 lemons","1 bulb of fennel","½ a bunch of fresh-flat leaf parsley , (15g)","½ a bunch of fresh marjoram , (15g)","1 bunch of fresh chives , (30g)","4 kg rock salt","2 large free-range eggs"],"method":["Preheat the oven to 180°C,350°F,gas 4.","Wash the salmon well both inside and out, then pat dry with kitchen paper.","Finely slice 1 lemon and the fennel into rounds and stuff into the salmon cavity with the parsley, marjoram and chives.","Combine the rock salt, eggs and 250ml of water in a large bowl, then evenly spread one-third of the mixture over a large baking tray (35cm x 45cm).","Make a slight hollow in the middle to hold the salmon snugly, lay the salmon diagonally in the tray, then spoon over the remaining salt mixture, heaping it around and on to the salmon to create an even 2cm-thick layer all over the fish. Bake for 35 minutes.","To test if the salmon is ready, push a skewer through the salt into the thickest part of the fish – if it comes out warm after 5 seconds, it’s done. Remove from the oven and set aside in the crust for just 1 hour.","Meanwhile, make the basil yoghurt. Pick the basil leaves into a blender and add the mustard, the juice of 1 lemon and half the yoghurt. Blitz until smooth, then fold back through the rest of the yoghurt with 4 tablespoons of oil, and season to perfection with sea salt and black pepper."]},{"_id":"5c16f967c1941d50c6ae0f33","category":"Salmon","name":"Green tea roasted salmon","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1585_9_1439905728.jpg?tr=w-430","https://c1.staticflickr.com/8/7460/10736958163_41225f727b_b.jpg","http://images.media-allrecipes.com/userphotos/960x960/5147291.jpg","https://cdn-image.myrecipes.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/roasted-salmon-kale-quinoa-salad.jpg?itok=BYoSUBJu","https://i1.wp.com/seashellsandsweettea.com/wp-content/uploads/2017/06/Cedar-Roasted-Salmon_thumb.png?resize=684%2C684&ssl=1"],"ingredients":["150 g brown rice","1 x 500 g salmon tail, skin on, scaled, bone in, from sustainable sources","1 green tea bag","sesame oil","1 clove of garlic","320 g mixed salad veg, such as carrots, cucumber, tomato, chicory","1 small ripe mango","1 lime","low-salt soy sauce","1 fresh red chilli","1 x 3cm piece of ginger"],"method":["Preheat the oven to 180°C,350°F,gas 4.","Wash the salmon well both inside and out, then pat dry with kitchen paper.","Finely slice 1 lemon and the fennel into rounds and stuff into the salmon cavity with the parsley, marjoram and chives.","Combine the rock salt, eggs and 250ml of water in a large bowl, then evenly spread one-third of the mixture over a large baking tray (35cm x 45cm).","Make a slight hollow in the middle to hold the salmon snugly, lay the salmon diagonally in the tray, then spoon over the remaining salt mixture, heaping it around and on to the salmon to create an even 2cm-thick layer all over the fish. Bake for 35 minutes.","To test if the salmon is ready, push a skewer through the salt into the thickest part of the fish – if it comes out warm after 5 seconds, it’s done. Remove from the oven and set aside in the crust for just 1 hour.","Meanwhile, make the basil yoghurt. Pick the basil leaves into a blender and add the mustard, the juice of 1 lemon and half the yoghurt. Blitz until smooth, then fold back through the rest of the yoghurt with 4 tablespoons of oil, and season to perfection with sea salt and black pepper."]},{"_id":"5c16f9ebc1941d50c6ae0f34","category":"Salmon","name":"Salmon nicoise","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/0IL7VZPh4DWAuSq6-R5Cl9.jpg?tr=w-430","https://cdn-image.myrecipes.com/sites/default/files/styles/medium_2x/public/image/recipes/su/10/05/salmon-nicoise-su-x.jpg?itok=SD6N28fV","https://img.taste.com.au/4bZ6-VTi/w720-h480-cfill-q80/taste/2016/11/salmon-nicoise-104961-1.jpeg","https://images.ctfassets.net/qu53tdnhexvd/6QX12D88MMasqyAykOou8y/47cbf542446690b501f0d7a86f47901a/salmon-nicoise-salad.jpg","https://food-images.files.bbci.co.uk/food/recipes/grilledsalmonnicoise_67919_16x9.jpg"],"ingredients":["240 g salmon fillet, from sustainable sources","olive oil","200 g new potatoes","100 g green beans","2 large free-range eggs","1 soft round lettuce","1 handful of black olives (stone in)","4 ripe plum tomatoes","1 clove of garlic","3 tablespoons extra-virgin olive oil","1 lemon"],"method":["Season the salmon with sea salt and black pepper, then add, skin-side down, to a hot frying pan with 3 tablespoons of olive oil. Fry for 4 minutes, then turn and cook for a further 2 minutes.","Remove from the pan and set aside to cool, then flake into chunks.","Halve the new potatoes and boil with the beans until tender, then refresh in cold water.","Cook the eggs in a pan of boiling water for 6 minutes to hard-boil, then remove, peel and quarter.","To make the dressing, peel and finely chop the garlic, then combine in a large bowl with the extra virgin olive oil, lemon juice, mustard and a pinch of salt and pepper.","Add the lettuce leaves to the dressing with the potatoes, beans and olives. Cut the tomatoes into wedges, add to the bowl, then toss to coat.","Divide between 2 bowls and top each with the egg quarters and flaked salmon."]},{"_id":"5c16fa3dc1941d50c6ae0f35","category":"Salmon","name":"Salmon with young garlic & tomato sauce","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/4SMvZ0tSaOYAQsM-kXjXFr.jpg?tr=w-430","http://thecleanlean.com/wp-content/uploads/2017/04/fasdfasdfas.jpg","https://scrummylane.com/wp-content/uploads/2017/05/lemon-butter-salmon-5.jpg","https://i.pinimg.com/originals/11/60/fd/1160fdca00cb3d5e0470b9d4b0a7e836.jpg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--52738_10.jpg?itok=SHmSjftT"],"ingredients":["1 bulb of fresh young garlic (if you can’t find young garlic, substitute with 2 chopped cloves of garlic and 1 sliced bulb of fennel)","1 punnet ripe cherry tomatoes","1 lemon","olive oil","4 salmon fillets , skin on, scaled and pin-boned, from sustainable sources","a few sprigs of fresh mint","a few sprigs of fresh dill"],"method":["Slice the bulb of garlic into thin wedges, then squash the tomatoes. Halve the lemon, then slice half finely.","Add a good drizzle of oil to a hot frying pan and fry the garlic until it softens and caramelises. Add the tomatoes and cook till they soften.","In another pan, heat oil on a medium-high heat. Season the salmon and cook, skin-side down, for 3 minutes. Turn, add the lemon slices to the pan, and cook for 2 minutes, or till the salmon is done to your liking.","Pick, finely chop and stir the mint and dill through the sauce, then tip over the salmon fillets and serve."]}]},{"_id":"5c213668cdb44d211e7a9a2a","category":"Sea bass","image":"https://www.kitchentales.co.uk/wp-content/uploads/Malaysia_P0166_39-Seabass-Goreng-Kecap-Manis-cropped.jpg","recipes":[{"_id":"5c170244c1941d50c6ae0f40","category":"Sea bass","name":"Thai-style crispy sea bass","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/64975515.jpg?tr=w-430","https://arecipeforgluttony.files.wordpress.com/2014/03/thai-salad-1-640x403.jpg","https://jonoandjules.files.wordpress.com/2018/02/thai-style-crispy-sea-bass.jpg?w=500","https://img.taste.com.au/H2SPiLrc/w720-h480-cfill-q80/taste/2016/11/thai-crispy-fish-with-tamarind-sauce-96805-1.jpeg","http://thetalentzone.co.uk/musictv/wp-content/uploads/2018/06/sea-bass.png"],"ingredients":["4 spring onions","½ a bunch of fresh coriander , (15g)","2 x 300 whole sea bass , scaled, gutted, trimmed, from sustainable sources","2 tablespoons Thai red curry paste","1 lime"],"method":["Trim and halve the spring onions, finely shred lengthways and place in a bowl of ice-cold water to crisp up. Pick in the coriander leaves, reserving the stalks.","Place a large non-stick frying pan on a medium-high heat. With a sharp knife, score the sea bass skin at 2cm intervals, then rub all over with the curry paste, inside and out, getting into all the cracks and crannies. Pack the coriander stalks into the cavities, season with sea salt and black pepper, then place in the hot pan with 1 tablespoon of olive oil. Cook for 3 to 4 minutes per side, or until dark golden and cooked through (depending on the thickness of your fish).","Drain and shake off the spring onions and coriander and pile on to your plates. Sit the sea bass on top, spooning over any spicy oil from the pan. Finely grate over the lime zest, and serve with lime halves, for squeezing over."]},{"_id":"5c1702eec1941d50c6ae0f41","category":"Sea bass","name":"Fish in crazy water","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77638951.jpg?tr=w-430","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/bream.jpg?itok=W5G1e4pn","https://panningtheglobe.com/wp-content/uploads/2015/08/fish-crazy-water-new-web.jpg","https://iprx.ten.com.au/ImageHandler.ashx?f=jpg&u=%2F%2Fimages.tenplay.com.au%2F%7E%2Fmedia%2FRecipes%2FImported+Images%2F7%2F4517-7BF7137C.jpg","https://thegarumfactory.files.wordpress.com/2014/12/pesce-all-acqua-monkfish-in-crazy-water-3799.jpg?w=750&h=500","http://www.expressfoodie.com/wp-content/uploads/2016/10/fratelli1-850x468.jpg"],"ingredients":["2 spring onions","½ a bulb of fennel","1 carrot"," 200 g ripe mixed-colour cherry tomatoes , on the vine","3 cloves of garlic","½ a fresh red chilli","8-10 mixed olives , (stone in)","olive oil","2 x 350 g whole round fish , such as royal bream, trout, sea bass, red mullet, scaled, gutted, gills removed, from sustainable sources"],"method":["Trim the spring onions and fennel (reserving any leafy tops), peel the carrot, then slice them all ½cm thick. Halve the tomatoes. Peel and finely slice the garlic and chilli. Squash and destone the olives. Put a large frying pan on a high heat with 1 tablespoon of olive oil. Stir in the onions, fennel and carrot, followed 4 minutes later by the tomatoes, garlic, chilli and olives. Toss regularly for 2 minutes while you lightly score the fish on both sides (this will help flavour and heat to penetrate as it cooks).","Lay the fish on top of the veg, stuff half the herbs into the cavities, then pour over the wine and let it reduce by half. Add about 300ml of water, to come 1cm up the side of the pan. Cover and leave to thunder away on a high heat for 8 minutes (boiling underneath, steaming on top means fragrant veggies). Pick the remaining herb leaves, finely grate the lemon zest over them, then chop and mix together.","Uncover the fish and baste with its juices for 1 minute. To check the fish is cooked, go to the thickest part up near the head – if the flesh flakes easily away from the bone, it’s done. Remove to a plate, spoon over the veg and juices, drizzle with extra virgin olive oil, scatter over the lemony herbs, then squeeze over the lemon juice. Great served with bread to mop up that irresistible sauce, or with new potatoes, couscous or rice."]},{"_id":"5c1703d8c1941d50c6ae0f42","category":"Sea bass","name":"Sea bass in puff pastry","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1411_1_1436885058.jpg?tr=w-430","https://img.buzzfeed.com/thumbnailer-prod-us-east-1/f00c015cedd148eca7fe5cac9aa56c2b/BFV37214_WolfgangsOscarDishes_FB_Final.jpg?output-quality=60&resize=1000:*","https://images.eatsmarter.com/sites/default/files/styles/920x690/public/sea-bass-and-salmon-in-puff-pastry-601354.jpg","https://www.jusrol.co.uk/wp-content/uploads/2018/08/242_Image_Hero-Image_2018_7_6_20_9_0-1.jpg","https://chezann.files.wordpress.com/2012/06/sea-bass-en-croute-616.jpg","https://images.eatsmarter.com/sites/default/files/styles/920x690/public/sea-bass-in-puff-pastry-612936.jpg"],"ingredients":["60 g small cooked prawns","2 tbsp tarragon , finely chopped","1 tbsp olive oil , plus extra for greasing","1 large free-range egg , beaten","2 tbsp milk","plain flour , for dusting","500 g puff pastry , halved","1 kg whole sea bass , filleted (ask your fishmonger to do this)","green salad , to serve"],"method":["Preheat the oven to 220ºC,450ºF,gas 7. Combine the prawns, tarragon and olive oil in a small bowl and season generously. For the egg wash, whisk the egg and milk in a small bowl and set aside.","Lightly flour a work surface and roll out half of the pastry to a rectangular shape about 5mm thick and 10cm longer than the fish fillets (for the head and tail). Transfer to a lightly oiled baking tin.","Place one of the fillets, skin-side down, on the pastry, leaving a little more space at one end for the tail shape. Spoon the prawn and tarragon mixture over the fish and place the other fillet on top. Brush the edges of the pastry with the egg wash.","Roll out the remaining pastry to the same size and use this to cover the fish, pressing the edges carefully to seal them. Use a small, sharp knife to trim the excess and create your fish shape. Then, with a teaspoon, score half-moon shapes into the pastry in the style of fish scales (but don’t pierce the pastry).","Meanwhile, make the salsa verde. Roughly chop the herb leaves in the centre of a large chopping board. Add the garlic, cornichons, capers and anchovies and continue chopping until fine, mixing it together as you go. Transfer to a bowl, stir in the olive oil and vinegar, and season well. "]},{"_id":"5c170480c1941d50c6ae0f43","category":"Sea bass","name":"Sea bass, fennel & grapefruit ceviche","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1237_1_1436885379.jpg?tr=w-430","http://www.alice.is/assets/532897afd6af681c3d00020e/960px/seabass_ceviche.JPG","https://www.tastewiththeeyes.com/wp-content/uploads/2016/11/IMG_8981-1024x682.jpg","https://maisoncupcake.com/mcc/wp-content/uploads/2015/11/Barbecoa-Restaurant-City-of-London-7.jpg","https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/salmoncevichewithfen_85539_16x9.jpg"],"ingredients":["500g seabass, scaled, filleted and pin-boned,from sustainable sources","2 fresh red chillies","1 clove of garlic","2 lemons","2 pink grapefruit","2 bulbs of fennel","½ a bunch of fresh mint","extra virgin olive oil"],"method":["Slice the fish into 1cm strips, place in a bowl and pop in the fridge.","Halve, deseed and chop the chillies into 1cm rounds. Peel and grate or finely chop the garlic, then place in a separate bowl or jam jar. Mix in the lemon juice and 1 teaspoon of sea salt, then pop in the fridge.","Cut the top and bottom off the grapefruit, carefully peel away the skin, then separate them into segments and put these in a bowl, squeezing the juice from a few segments into the bowl.","Reserving the bushy tops, trim and cut the fennel into thin wedges. Pick the mint leaves.","When you're ready to eat, get the fish out of the fridge and combine it with the fennel, grapefruit and most of the mint leaves. Give the marinade in the bowl or jam jar a mix, then pour the juices over the fish mixture. Delicately toss together and leave for 2 minutes 30 seconds.","Serve simply on a big platter, with the remaining mint leaves and the fennel tops sprinkled over, adding a little drizzle of oil and a few grinds of black pepper. "]},{"_id":"5c1704f5c1941d50c6ae0f44","category":"Sea bass","name":"Peruvian ceviche","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/992_1_1438787901.jpg?tr=w-430","https://cdn-image.myrecipes.com/sites/default/files/styles/medium_2x/public/image/recipes/su/06/06/peruvian-ceviche-mr-x.jpg?itok=BiGTihul","https://cms.splendidtable.org/sites/default/files/styles/w2000/public/atk_peruvian_style_fish_ceviche_radishes_orange-c-Carl-Tremblay-LEDE.jpg?itok=__EqNU-Y","https://tucsonfoodie.com/wp-content/uploads/2018/04/TF-villa-peru-ceviche-mixto-620x400.png"],"ingredients":["1 red or yellow pepper","2 spring onions","400 g skinless sea bass, lemon sole or snapper , pinboned, from sustainable sources","juice of 3 lemons","1-2 fresh red chillies","8 sprigs of fresh mint","8 sprigs of fresh coriande "],"method":["Deseed and very finely chop the pepper, and trim and finely slice the spring onions, then add to a bowl.","Slice the fish into 1cm cubes, add to the bowl, then cover and place in the fridge until needed.","Squeeze the lemon juice into a jam jar, add 1 teaspoon of sea salt, then seseed, finely chop and add the chilli.","Pop the lid on and place in the fridge to chill – this may seem like a lot of salt but most of it gets drained away. Pick the herbs and cress, and place in the fridge.","You can assemble the ceviche just before your guests are ready to eat, but it’s important that you don’t leave the fish marinating for too long – you don’t want the acids in the juices to cook the fish. Pour the lemon dressing over the fish mixture and immediately mix it up. Leave it to sit for about 2½ minutes while you lay out the plates. "]},{"_id":"5c170593c1941d50c6ae0f45","category":"Sea bass","name":"Asian-steamed sea bass","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/956_36_1434037341.jpg?tr=w-430","http://www.seriouseats.com/images/2015/02/20150213-steamed-fish-fermented-black-beans-garlic-shao-zhong-7-1500x1125.jpg","http://prod-upp-image-read.ft.com/baab2580-338c-11e2-aa83-00144feabdc0","https://i0.wp.com/salu-salo.com/wp-content/uploads/2016/10/Steamed-Sea-Bass-1-2.jpg?resize=600%2C400","https://i.pinimg.com/474x/f4/ce/9e/f4ce9e5128581a9a75fa7d05ba34128d--sea-bass-recipes-asian-white-fish-recipes.jpg"],"ingredients":["1 x 1.5 kg whole sea bass , scaled, gutted, gills removed, from sustainable sources","5 spring onions","1 fresh red chilli","5 cm piece of ginger","1 bunch of fresh coriander , (30g)","1 lime","low-salt soy sauce","sesame oil"],"method":["Score the sea bass on both sides at 2cm intervals, cutting roughly 1cm deep, then place into the steamer tray of your oven (or see tip). Season the inside and both sides of the fish lightly with sea salt.","Trim the spring onions and chilli (deseed if you like), then finely slice. Peel and finely chop the ginger, then pick the coriander leaves and finely slice the stalks.","Mix the spring onions, chilli, ginger, coriander stalks and most of the leaves together on a board, then stuff and push into the cavity and scores in the fish.","Squeeze over the lime juice, adding the squeezed lime halves to the tray. Hit it up with a splash of soy sauce, then cover with the lid.","Fill the steamer pocket on the front of the oven with around 1 litre of water, then slot the steamer tray into the bottom of the oven so that the metal nozzle on the tray engages with the back of the oven. Set to steam for around 25 minutes, or until cooked to perfection.","Serve on a bed of fluffy rice, drizzled with the juices from the bottom of the steamer tray, a drizzle of sesame oil and the remaining coriander leaves sprinkled over."]},{"_id":"5c170619c1941d50c6ae0f46","category":"Sea bass","name":"Stuffed sea bass","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/564_1_1350909025.jpg?tr=w-430","http://goodthingsmagazine.com/wp-content/uploads/2015/06/SeaBassFillets-OPT02.jpg","http://www.recipe4living.com/assets/itemimages/400/400/3/e496cc09a717863c957adea97f9bcb1d_seabass.jpg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--329487_12.jpg?itok=bXPw6-Rt","https://topsecretrecipes.com/images/product/pf-changs-oolong-marinated-seabass-copycat-recipe.jpg","https://cdn.shopify.com/s/files/1/2010/7963/products/Mero_2048x2048.jpg?v=1501010096"],"ingredients":["2 whole sea bass , from sustainable sources, ask your fishmonger, cleaned and gutted, head and tail on","1 whole fennel","1 teaspoon fennel seeds","2 cloves garlic","50 ml olive oil","35 g butter","½ a bunch of fresh dill","½ a bunch of fresh flat-leaf parsley","½ a bunch of fresh basil "],"method":["Preheat the oven to 190°C,375°F,gas 5. Finely slice the whole fennel, peel and finely slice the garlic and lightly crush the fennel seeds. Place a medium pan over a medium heat and add the olive oil and half the butter. Once hot, add the fennel and fennel seeds and fry gently for around 5 minutes. Add the garlic and continue cooking for around 5 minutes, or until the fennel is soft, golden brown and sweet. Set aside to cool.","Meanwhile, place a medium pan over a high heat and cook the potatoes for around 5 minutes, or until parboiled. Drain and set aside. Finely chop all the herbs together and add to a bowl along with remaining butter, then mix well until combined and set aside. Ensure the sea bass is clean inside and out, pat dry with kitchen paper and make 3 diagonal cuts into one side of the fish down to the bone. Stuff the cuts with the herb butter and fill the cavity of each fish with 2 slices of lemon and the cooked fennel.","Gently transfer the fish to the inside of the foil bag or onto the foil. Add in the whole potatoes, capers, tomato sauce and white wine. Seal the foil bag at the end or, if you're using foil, fold it up like a parcel.","Place the foil bags onto a baking tray and pop into the oven. Bake for 20-25 minutes, or until cooked through. Remove from the oven and allow to sit for 2-3 minutes, then place onto a serving plate, carefully open and enjoy with a crisp green salad or steamed vegetables."]},{"_id":"5c1706d0c1941d50c6ae0f47","category":"Sea bass","name":"Steamed Asian sea bass in the bag","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/544_1_1439310616.jpg?tr=w-430","http://rk.wsimgs.com/wsimgs/rk/images/dp/recipe/201707/0072/img66l.jpg","https://www.themediterraneandish.com/wp-content/uploads/2018/01/Pan-Seared-Sea-Bass-Recipe-The-Mediterranean-Dish-2.jpg","https://thumbor.thedailymeal.com/oJXCATBozjETXwWwoQlwEdHt1gc=/390x347/filters:focal(2947x4489:2948x4490)/https://www.thedailymeal.com/sites/default/files/recipe/2017/Morimoto-Nitsuke.JPG","https://www.royalcaribbean.com/anthemoftheseas/wp-content/themes/anthem/dining/photogallery/jamies/jamies-6.jpg"],"ingredients":["6 kaffir lime leaves","1-2 sticks lemon grass , chopped","1 clove garlic , finely sliced","1-2 red chillies , to taste, seeded and chopped","1 small tablespoon freshly grated ginger","1 handful coriander , leaves picked and stalks reserved, plus extra to serve","1 tablespoon Kikkoman low-salt soy sauce","1 lime , zested and halved","2 tablespoons olive oil"],"method":["Take the top shelf out of the oven and place a baking tray on the middle shelf.","Tear off a metre of kitchen foil. Fold it in half so it’s double thickness, then fold it in half again. You should end up with what looks like a big, foil birthday card. Make two of these then lay them opened and flat on your table. Each foil wrap will hold one piece of fish – you can do a big one for four or a slightly smaller version for two.","In a pestle and mortar, bash your lime leaves until they break down and all the flavour comes out. Then add the lemon grass and do the same again. Do this for a couple of minutes... it’s worth every second. Then add the garlic, chilli, grated ginger and all of the coriander stalks. Once this is all smashed to a pulp, add the soy sauce, the lime zest and juice and the olive old. Mix well, then taste and correct the seasoning with extra soy sauce as you see fit.","Lightly score the sea bass on the skin side with a sharp knife and then rub them with the lime-ginger-lemon grass mix. Allow to marinate for an hour, if you have time, or you can cook it all straight away. "]},{"_id":"5c17074dc1941d50c6ae0f48","category":"Sea bass","name":"Steamed Thai-style sea bass and rice","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/547_1_1438963293.jpg?tr=w-430","https://burpple-2.imgix.net/foods/5c203468084cc3398846250_original.?w=645&dpr=1&fit=crop&q=80","https://gbc-cdn-public-media.azureedge.net/img18922.1426x713.jpg","https://gbc.blob.core.windows.net/media/img15764.jpg","https://cdn-image.foodandwine.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/200602-r-xl-spicy-butter-steamed-bass.jpg?itok=6WZol9dV","https://gbc-cdn-public-media.azureedge.net/img25021.768x512.jpg"],"ingredients":["2 large bunches fresh coriander , leaves picked and stalks reserved","2 thumb-sized pieces fresh ginger , peeled","3 cloves garlic , peeled","2 fresh red chillies , halved and deseeded","2 teaspoons sesame oil","6 tablespoons soy sauce","2 limes , juice and zest of","400 ml light coconut milk"],"method":["Preheat the oven to 200ºC,400ºF,gas 6. In a food processor or liquidizer, whiz up the coriander stalks, half of the coriander leaves, the ginger, garlic, halved chillies, sesame oil, soy sauce, lime juice and zest and the coconut milk. This will give you a lovely fragrant Thai-style paste.","Cook your rice in salted, boiling water until it’s just undercooked, then drain it in a colander. Scoop it into a high-sided roasting tray. Pour your Thai paste over the rice and mix it in well, then shake it out flat. Lay the sea bass fillets on top, scatter over the sugar snap peas or mangetouts, then cover the dish tightly with tinfoil and put it in the preheated oven for around 15 minutes. Remove the foil and sprinkle over the spring onions, the sliced chilli and the other half of the coriander leaves. Divide between your plates with a wedge of lime. "]},{"_id":"5c1707abc1941d50c6ae0f49","category":"Sea bass","name":"Pan-cooked asparagus & mixed fish","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/373_1_1436870113.jpg?tr=w-430","https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/4/23/0/JH0213_Pan-Cooked-Asparagus-and-Mixed-Fish.jpg.rend.hgtvcom.826.620.suffix/1371585680200.jpeg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--52738_10.jpg?itok=SHmSjftT","https://recipes-secure-graphics.grocerywebsite.com/0_GraphicsRecipes/6464_400.jpg","https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSfNSxmBEpnYJnvenS5Wu4Q7ZWySgyVP82q8ZOoUWzBsbgicRmz"],"ingredients":["olive oil","2 small red mullet or snapper fillets , scaled, pin-boned, from sustainable sources","1 royal bream fillet or sea bass fillet , scaled, pin-boned, cut in half, from sustainable sources","2 small squid , gutted, cleaned, tentacles trimmed and reserved, from sustainable sources","2-4 freshly shelled scallops , cleaned and scored in a criss-cross fashion, from sustainable sources","10 medium asparagus spears , woody ends removed"],"method":["Get a really large frying pan, or two smaller ones, on the heat and add a lug of olive oil. Score the skin of your fish fillets all over, about 1cm deep, and season.","Put the fish fillets into the pan, skin side down, with the squid tentacles. Add the scallops. Run your knife down one side of each squid to open them out, then quickly and lightly score the inside in a criss-cross fashion. Lay them in the pan, scored side down.","Add the asparagus and gently shake the pan. Cook for a few minutes, then turn everything over and cook on the other side. Sprinkle over the thyme tips.","You’re the one in control of the pan, so if something looks cooked, take it out and keep it warm. Don’t watch things burn! When the fish has crispy skin, the scallops are golden brown with caramelized edges and the squid has curled up and is nicely chargrilled, remove the pan from the heat.","Put the squid on a chopping board and roughly slice it into pieces at an angle, then return to the pan. Lay the fish fillets on each plate. Toss the asparagus, scallops and squid with half the chilli, a good drizzle of good-quality extra virgin olive oil and the lemon juice. Lightly season and mix together. "]}]},{"_id":"5c212ef159d6ce156096e229","category":"Seafood","image":"https://www.stockland.com.au/~/media/shopping-centre/common/campaigns/a-to-z-of-mmmm/miguels-seafood-bbq/miguel-maestres-seafood-bbq--a-to-z-of-mmmm.ashx","recipes":[{"_id":"5c16b05e6088974c52cb10c6","category":"Seafood","name":"Sticky sesame prawns","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46209875.jpg?tr=w-430","https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQq51uRDJNCuF_QAlc1M2EDKNhj5frgRG8zYTF1aNLS8kkJmDw2jw","https://be35832fa5168a30acd6-5c7e0f2623ae37b4a933167fe83d71b5.ssl.cf3.rackcdn.com/5585/prawns__small-square.jpg"],"ingredients":["2 carrots","½ a cucumber","100 g snow peas","200 g tenderstem broccoli","300 g fine rice noodles","3 limes","2 tablespoons sesame seeds","vegetable oil","16 large raw shell-on green banana king prawns from sustainable sources","2 spring onions","1 fresh red chilli","1 bunch of fresh coriander"],"method":["For the sauce, peel and finely grate the ginger and garlic into a medium pan. Trim and finely slice the spring onions and add to the pan.","Add the chilli sauce, apple juice, honey and miso, then place over a medium heat and bring to the boil. Reduce the heat to low and simmer for 5 minutes, or until syrupy and it coats the back of a spoon.","Peel and matchstick the carrots and cucumber, then finely slice the snow peas and halve each stem of broccoli along the stalk.","Cook the rice noodles according to the packet instructions, adding the broccoli to blanch with the rice noodles. Drain and toss in 3 tablespoons of the sauce and the juice of 2 limes.","Toast the sesame seeds in a small pan over a medium heat for 3 minutes, or until golden.","Heat a splash of oil in a large frying pan over a high heat, then add the whole prawns and stir-fry for 3 minutes, or until pink all over.","Pour in the remaining sauce and continue to cook for a further 2 minutes, or until the prawns are sticky and caramelised and the sauce is thick and glossy, then tip over the noodle salad.","Trim and finely slice the spring onions and chilli, and pick the coriander leaves. Scatter everything over the top of the salad, serve with lime wedges for squeezing over and tuck in."]},{"_id":"5c16b33b4428764dc32a446f","category":"Seafood","name":"Summer fish stew","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77732373.jpg?tr=w-430","http://sakurahouse-blog.com/ar/files/2014/11/teeen.jpg","https://assets.epicurious.com/photos/54b87c137cbba01c0db7ff8d/master/pass/51248830_cioppino_1x1.jpg"],"ingredients":["1 x Garlic aïoli","1 onion","1 clove of garlic","1 stick of celery","1 large potato","1 fresh red chilli","½ a bunch of fresh flat-leaf parsley (15g)","olive oil","150 ml Prosecco","1 x 680 g jar of passata","2 large bream fillets , scaled, pin-boned, from sustainable sources","4 langoustines , shell on, from sustainable sources","400 g mixed mussels & clams , scrubbed, debearded, from sustainable sources","200 g squid tubes , cleaned, from sustainable sources","100 g freshly podded peas","4 thick slices of rustic bread "],"method":["Make your Garlic aïoli. Peel the onion, garlic, celery (picking and saving any yellow leaves from the head) and potato. Finely chop the onion and garlic with the chilli (deseed, if you like) and parsley stalks (reserving the leaves). Chop the celery and potato into 1cm chunks. Place it all in a large casserole pan on a medium heat with 2 tablespoons of oil, and cook for 10 minutes, or until softened, stirring occasionally.","Stir in the Prosecco and let it simmer for 2 minutes. Pour in the passata and half a jar’s worth of water, add a good pinch of sea salt and black pepper, then add the bream and langoustines, pushing them down into the sauce. Simmer gently while you quickly pick through the mussels and clams, tapping any open ones – if they don’t close, discard them. Finely slice the squid into rings. Add the mussels, clams, squid and peas to the pan with a splash of water, if needed, then cover and leave for a few minutes, or until the mussels and clams have opened (discard any that remain closed).","Place a slice of bread in each of your bowls (toast first, if you like), ladle the stew on top, dollop each portion with ½ a tablespoon of aïoli (saving the rest for another day), then tear over the reserved parsley and any celery leaves. If you’ve got them, fennel tops are a lovely finishing touch, too."]},{"_id":"5c16b4824428764dc32a4470","category":"Seafood","name":"Thai-style crispy sea bass","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/64975515.jpg?tr=w-430","https://arecipeforgluttony.files.wordpress.com/2014/03/thai-salad-1-640x403.jpg","https://previews.123rf.com/images/akeeris/akeeris1701/akeeris170100046/71223177-a-dish-of-brown-crispy-deep-fried-whole-sea-bass-fish-with-thai-style-spicy-dip-sauce-.jpg"],"ingredients":["4 spring onions","½ a bunch of fresh coriander , (15g)","2 x 300 whole sea bass , scaled, gutted, trimmed, from sustainable sources","2 tablespoons Thai red curry paste","1 lime"],"method":["Trim and halve the spring onions, finely shred lengthways and place in a bowl of ice-cold water to crisp up. Pick in the coriander leaves, reserving the stalks.","Place a large non-stick frying pan on a medium-high heat. With a sharp knife, score the sea bass skin at 2cm intervals, then rub all over with the curry paste, inside and out, getting into all the cracks and crannies. Pack the coriander stalks into the cavities, season with sea salt and black pepper, then place in the hot pan with 1 tablespoon of olive oil. Cook for 3 to 4 minutes per side, or until dark golden and cooked through (depending on the thickness of your fish).","Drain and shake off the spring onions and coriander and pile on to your plates. Sit the sea bass on top, spooning over any spicy oil from the pan. Finely grate over the lime zest, and serve with lime halves, for squeezing over."]},{"_id":"5c16b5b44428764dc32a4471","category":"Seafood","name":"Smoked salmon, prawns & Miami cocktail sauce","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/60037505.jpg?tr=w-430","https://www.passion.ru/imgs/2017/05/23/13/1264845/a9faade710496fb91ea50cad6214697f7ca8f477.jpg","https://piermarket.com/wp-content/uploads/2016/04/PM_ShrimpFriedPartyTail_H_LR_EW_1200x638.jpg"],"ingredients":["3 baby gem lettuces","300 g smoked salmon , from sustainable sources","24 large cooked peeled prawns , from sustainable sources","1 lime","extra virgin olive oil","½ a large clove of garlic","2 cm piece of ginger","1 spring onion","a few sprigs of fresh coriander","4 tablespoons free-range mayonnaise","4 tablespoons tomato ketchup","2 tablespoons chilli sauce","1 teaspoon English mustard "],"method":["Peel and finely grate the garlic and ginger, trim and slice the spring onion, pick and finely chop the coriander leaves, then add to a bowl with the rest of the cocktail sauce ingredients. Mix well to combine, then chill in the fridge for 1 hour.","Trim the lettuce, separate the leaves and divide between plates. Drape over the smoked salmon, then arrange the prawns on top.","Dress the lettuce and seafood generously with the cocktail sauce. Cut the lime into wedges and squeeze a little juice over each plate, drizzle over some oil and finish with a good grinding of black pepper."]},{"_id":"5c16b8d04428764dc32a4472","category":"Seafood","name":"Prawn and watermelon salad","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/419_36_1434038679.jpg?tr=w-430","https://taste.co.za/wp-content/uploads/2016/01/bills-prawn-feNNel-and-watermelon-salad-with-chilli-dressing.jpg","http://images.honestcooking.com/wp-content/uploads/2016/08/Prawn-Watermelon-Salad-1.jpg"],"ingredients":["2 limes , zest and juice of","12 raw prawns , from sustainable sources, ask your fishmonger, peeled","100 g unsalted cashews","1 tablespoon sesame seeds","1 small bunch mint","1 red chilli , deseeded and finely chopped","2 handfuls baby spinach","400 g watermelon , seeds removed, cut into chunks","4 spring onions , finely sliced","sesame oil","sea salt","freshly ground black pepper"],"method":["Prawns quickly marinated in lime juice and stir-fried, tossed in a salad with mint, chilli, baby leaf spinach, chunks of watermelon and toasted crushed sesame seeds, peanuts and cashew nuts. Delicious!","Put the zest and juice of one of the limes in a bowl and toss the prawns in it. Leave to marinate while you prepare the other ingredients.","Heat a wok or frying pan, then add the cashews and heat until lightly toasted.","Add the sesame seeds for 30 seconds until they start to brown and pop, then remove all the nuts from the pan. Crush lightly with the bottom of a saucepan and place in a big mixing bowl.","Add the mint, chopped chilli, baby spinach, watermelon and spring onion to the mixing bowl and toss with the toasted nuts.","Add the prawns to the hot pan with a splash of sesame oil, season with salt and pepper and stir-fry lightly for a few minutes until cooked through.","Toss the cooked prawns with the other ingredients in the mixing bowl and season with lime juice, sesame oil, salt and pepper.","Tip: If you can’t find cashews, unsalted peanuts will do instead."]},{"_id":"5c16bb18c1941d50c6ae0ef5","category":"Seafood","name":"Patsy's garlic & chilli prawns","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/59888883.jpg?tr=w-430","https://flockler.com/thumbs/sites/192/prawns-with-garlic_s640x0_c723x422_l45x182_q70_noupscale.jpg","https://i.pinimg.com/345x/b5/9c/ed/b59cedac1c019d3d8d9be71c25dadc35.jpg"],"ingredients":["8 large raw shell-on king prawns , from sustainable sources","3 cloves of garlic","1 fresh red chilli","a few sprigs of fresh flat-leaf parsley","50 ml olive oil , ideally Spanish","½ teaspoon smoked paprika","1 lemon"],"method":["Peel the prawns, removing the heads and leaving the tails on. Run the tip of a knife down the backs of the peeled prawns and pull out and discard the dark vein.","Peel the garlic and finely chop with the chilli (deseed if you like). Pick and finely chop the parsley leaves.","Drizzle the oil into a shallow heatproof terracotta dish or a small frying pan over a medium-high heat, add the garlic and chilli and fry for 30 seconds to flavour the oil, before stirring in the paprika.","Add the prawns and fry for 2 minutes on each side, or until cooked through, adding most of the parsley when you turn the prawns.","Squeeze half the lemon juice into the dish, then remove from the heat and sprinkle over the remaining parsley and a pinch of sea salt.","Serve sizzling with warm crusty bread, the remaining lemon cut wedges for squeezing over, and a glass of good Spanish wine. "]},{"_id":"5c16bbd5c1941d50c6ae0ef6","category":"Seafood","name":"Grilled squid salad","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77460209.jpg?tr=w-430","https://cmkt-image-prd.global.ssl.fastly.net/0.1.0/ps/4573728/910/1343/m1/fpnw/wm1/z9e4xo2kergjdtyraffhs1w0if1ewi1nudopxqa7omrpzvbekragece2gq2vinok-.jpg?1528391545&s=17adb8415eb70431875f314bd6d0d7f4","https://static01.nyt.com/images/2015/08/14/dining/14CHICKENBREASTS/14CHICKENBREASTS-superJumbo.jpg"],"ingredients":["2 tablespoons baby capers in brine","2 lemons","extra virgin olive oil","1 clove of garlic","1 fresh red chilli","4 anchovy fillets in oil , from sustainable sources","30 g shelled unsalted pistachios","½ a bunch of fresh mint , (15g)","4 large squid , cleaned, gutted, from sustainable sources","500 g large ripe tomatoes "],"method":["Soak the capers in a bowl of water. Squeeze all the lemon juice into a large shallow bowl and add 4 tablespoons of oil. Peel the garlic and finely chop with the chilli, anchovies, pistachios, drained capers and mint leaves. Scrape it all into the bowl and mix together well.","Reserving the tentacles, run a sharp knife down the length of each squid tube, cutting through one side only so you can open each one out like a book. Lightly score the inside of each tube in a criss-cross fashion at ½cm intervals. To cook the squid, follow Franchina’s guidance and get the tentacles on early, then add the tubes, from largest to smallest. In a screaming hot griddle pan or on a barbecue, cook each piece for about 1 minute per side – with no oil or seasoning – until lightly charred and starting to curl. Start with the cut side when you do the tubes, and keep the squid moving for even cooking. As each piece is done, use tongs to dunk it straight into the salsa, turning and coating it in all that flavour.","Slice the tomatoes and lay over a serving platter. Finely slice the squid tubes, pull the tentacles apart, then arrange on top of the tomatoes. Spoon over all the remaining salsa, and serve hot or at room temperature. "]},{"_id":"5c16bc65c1941d50c6ae0ef7","category":"Seafood","name":"Grilled Scottish langoustines","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/63227640.jpg?tr=w-430","https://images.immediate.co.uk/volatile/sites/2/2017/07/LANGOUSTINES.jpg?quality=45&resize=960,413","http://www.alati.sg/wp-content/gallery/our-menu-slider/grilled-langoustines-highres-our-menu-slider.jpg"],"ingredients":["10 medium langoustines , from sustainable sources","25 g higher-welfare 'nduja","40 g unsalted butter , (at room temperature)","1 lemon "],"method":["Add 40g sea salt to 2 litres of water and bring to the boil in a large pan. Have a large bowl ready with 2 litres of ice-cold water.","Plunge the langoustines into the hot water for 40 seconds (using tongs), remove and refresh in the cold water, then shake dry.","Once blanched, carefully cut each langoustine in half lengthways.","Preheat the grill to medium–high.","Blitz the ’nduja in a blender with 20ml of warm water until you have a smooth paste. Add the butter and blend again to combine.","Lay the langoustines cut-side-up on a large roasting tray, loosen them within their shells, and spoon over the ’nduja butter.","Place under the grill for 4 to 5 minutes, or until the butter is bubbling and the langoustines are golden. Finish with a squeeze of lemon juice, and serve with napkins and toothpicks for picking the meat. "]},{"_id":"5c16bd2ac1941d50c6ae0ef8","category":"Seafood","name":"Sizzling seared scallops","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846349.jpg?tr=w-430","https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fimg1.cookinglight.timeinc.net%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2F1533067184%2Fseared-scallops-with-shallot-herb-sauce-1809-p48.jpg%3Fitok%3DxdAW987E&w=1000&c=sc&poi=face&q=70","https://cdn-image.myrecipes.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/seared-scallops-chestnut-puree-ck.jpg?itok=_BZjesLO"],"ingredients":["400 g potatoes","200 g frozen peas","½ a bunch of fresh mint (15g)","6-8 raw king scallops , coral attached, trimmed, from sustainable sources","50 g firm higher-welfare black pudding"],"method":["Wash the potatoes, chop into 3cm chunks and cook in a pan of boiling salted water for 12 minutes, or until tender, adding the peas for the last 3 minutes.","Meanwhile, pick and finely chop most of the mint leaves and put aside.","Place a non-stick frying pan on a medium-high heat. Once hot, put 1 tablespoon of olive oil and the remaining mint leaves in to crisp up for 1 minute, then scoop the leaves on to a plate, leaving the oil behind.","Season the scallops with sea salt and black pepper and fry for 2 minutes on each side, or until golden. Crumble in the black pudding (discarding the skin) so it crisps up alongside.","Drain the peas and potatoes, return to the pan, mash well with the chopped mint and 1 tablespoon of extra virgin olive oil, taste and season to perfection.","Plate up with the scallops and black pudding, drizzle lightly with extra virgin olive oil, and sprinkle over the crispy mint. "]},{"_id":"5c16bdb6c1941d50c6ae0ef9","category":"Seafood","name":"Smoked salmon blinis","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/Ff7Hwbw7KU9A-b20vGfvq1.jpg?tr=w-430","http://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/food/2014/11/28/WomansDayBR106277/cheese-and-dill-blini-with-smoked-salmon.jpg?width=1229&height=768&mode=crop&quality=75","https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/53/2014/05/Smoked-salmon-roses-on-rye-toast.jpg"],"ingredients":["1 cup of self-raising flour","1 large free-range egg","olive oil","1 cup of semi-skimmed milk","unsalted butter"],"method":["For the blinis, place the flour and a pinch of sea salt in a large mixing bowl. Make a well in the centre, crack in the egg and add 1 tablespoon of oil, then beat into the flour. Gradually whisk in the milk until you’ve got a lovely, smooth batter.","Put a large non-stick frying pan on a medium heat and add 1 small knob of butter. ","Once hot and the butter’s melted, add tablespoons of batter to the pan to make your blinis. Cook for 1 minute on each side, flipping over when they turn golden on the bottom and get little bubbles on top. ","The first batch always helps you figure out your temperature control, so adjust it up or down if needed.","Transfer the cooked blinis to a plate, and continue with the remaining batter until it’s all used up. Top with your favourite combos, season to perfection and enjoy."]}]},{"_id":"5c2133291ab9011be01960bc","category":"Beef","image":"https://www.tareekaa.com/wp-content/uploads/2017/04/%D8%B3%D8%AA%D9%8A%D9%83-%D8%A7%D9%84%D9%84%D8%AD%D9%85-%D8%A7%D9%84%D9%85%D8%B4%D9%88%D9%8A-%D8%B9%D9%84%D9%89-%D8%A7%D9%84%D8%AC%D8%B1%D9%8A%D9%84.jpg","recipes":[{"_id":"5c16df09c1941d50c6ae0f0e","category":"Beef","name":"Salt beef","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/83536217.jpg?tr=w-430","https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/53/2017/02/Salt-beef-recipe-920x605.jpg","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/07/poached-salt-beef-new-season-roots.jpg?itok=YNu6QGM_"],"ingredients":["1.6 kg kosher brined beef brisket","2 onions","4 fresh bay leaves","6 pink or black peppercorns"],"method":["Place the brisket in a large saucepan and cover with cold water.","Peel and quarter the onions, then add to the pan with the bay and peppercorns.","Bring to the boil, then reduce to a low heat and simmer for 2 to 2 hours 30 minutes, or until tender.","Carefully remove the brisket to a board, then slice up and serve warm with Yorkies and steamed greens."]},{"_id":"5c16e000c1941d50c6ae0f0f","category":"Beef","name":"Meltin' mustardy beef","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/64975492.jpg?tr=w-430","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/beef-in-red-wine-with-melting-onions.jpg?itok=1LRlPGo0","https://i.pinimg.com/236x/55/f3/d2/55f3d24f1b821d2ddb5cef8ca2d37c09--greek-beef-recipes-stifado.jpg"],"ingredients":["900 g shin of beef , bone out (ask your butcher for the bone)","500 g carrots","2 onions","120 ml Worcestershire sauce","2 heaped teaspoons wholegrain mustard"],"method":["Preheat the oven to 160ºC,325ºF,gas 3. Place a large shallow casserole pan on a high heat, with a large non-stick frying pan on a high heat alongside. Dice the beef into 5cm chunks and toss with a generous amount of black pepper and a pinch of sea salt, then dry fry in the hot frying pan with the bone for 8 minutes.","Meanwhile, wash and trim the carrots, chop into 5cm chunks, and place in the casserole pan with 1 tablespoon of olive oil. Peel and quarter the onions and break apart into petals, straight into the pan, stirring regularly. When the meat is nicely coloured, tip it into the casserole pan, then stir in the Worcestershire sauce and mustard, and cover with 800ml of boiling kettle water.","Cover, then cook in the oven for 4 hours, or until the beef is meltingly tender. Loosen with a splash of water, if needed. Taste, season to perfection, and serve. "]},{"_id":"5c16e04ac1941d50c6ae0f10","category":"Beef","name":"Messy meatball buns","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846368.jpg?tr=w-430","https://i.pinimg.com/736x/c5/6a/6d/c56a6d79eae4fc060661c6fbbfdd1ca7--partyfood-fingerfood.jpg","https://www.cookedperfect.com/wp-content/uploads/sites/239/2017/03/ItalianMeatballSandwichRecipe_Resized.jpg"],"ingredients":["400 g lean minced beef","8 heaped teaspoons green pesto","1 X 400 g tin of plum tomatoes","1 x 125 g ball of mozzarella","4 soft burger buns"],"method":["Use your clean hands to scrunch the minced beef with half the pesto and a pinch of sea salt and black pepper. Split into 12 pieces and, with wet hands, roll into balls. Brown the balls all over in a non-stick frying pan on a high heat with 1 tablespoon of olive oil, shaking the pan regularly.","Once the balls are golden and gnarly, pour in the tomatoes, breaking them up with a wooden spoon, along with just a quarter of a tin’s worth of water. Bring to the boil, slice the mozzarella and lay over the balls, pop the lid on and leave to thicken for 5 minutes on a medium heat. Meanwhile, warm your buns in a large dry non-stick frying pan or in the oven on a low heat.","Split each bun and spread 1 heaped teaspoon of pesto inside. Divvy up the balls and mozzarella with a little sauce, serving the rest on the side for dunking. "]},{"_id":"5c16e0d4c1941d50c6ae0f11","category":"Beef","name":"Black & blushing Worcestershire fillet","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46262159.jpg?tr=w-430","https://www.keystobasichealth.com/wp-content/uploads/2016/01/London-Broil-1280x640.jpg","https://www.ledhut.co.uk/blog/wp-content/uploads/2017/05/bbq-brisket.jpg"],"ingredients":["600-700 piece of fillet steak","2 heaped teaspoons French mustard","8-10 tablespoons Worcestershire sauce , plus extra for drizzling","a good drizzle of extra virgin olive oil , plus extra to serve","2 sprigs of fresh rosemary","unsalted butter","olive oil","thyme and rosemary flowers , optional"],"method":["The day before, or at least a few hours before cooking, put all the ingredients in a large sandwich bag (pick and finely chop the rosemary first).","Squeeze out the air then spend a few minutes massaging all the flavours into the meat. Put in the fridge for a few hours or overnight.","About 1½ hours before you’re ready to cook, remove the beef from the fridge and place in a cool corner of the kitchen to come up slowly to room temperature.","Preheat your barbecue. Put a few knobs of chilled butter into a bowl of cold water and take those outside with you when you’re ready to cook.","This next bit is going to be down to you and your intuition. What works for me every time is taking the fillet out of the bag, quickly patting it with kitchen paper then rolling it in olive oil and putting it on the hottest part of the barbecue to give it colour. Rub it with a chilled knob of butter as you cook it for about 8 to 10 minutes, turning every minute.","Once it looks good, move the fillet to a cooler part of the barbecue to finish cooking to your liking. Another 4 to 5 minutes, turning every minute, should give you medium-done meat. If you like it medium rare, cook it for less, or more for well done. It’s better to err on the side of under-done. That way, the worst-case scenario is that you take the fillet off, slice into it and find that it’s under-cooked, then have to put it back.","When you’re happy, put it on a platter, rub it again with butter so it really shines, then drizzle over more Worcestershire sauce, extra virgin olive oil, and thyme and rosemary flowers, if you have them.","Let the meat rest for a few minutes, before slicing at the table. Season from a height then quickly rub the slices in the juices before you let everyone grab some. "]},{"_id":"5c16e28dc1941d50c6ae0f12","category":"Beef","name":"Gluten-free beef lasagne","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1113_1_1437994308.jpg?tr=w-430","https://localfooddirect.imgix.net/wp-content/uploads/2018/09/4898_80618.jpg?fit=crop&fm=pjpg&w=533.33333333333&h=400","https://i.pinimg.com/originals/2a/50/39/2a503993fa7ed21d0c9522527207be91.jpg"],"ingredients":["2 carrots , peeled","2 onions , peeled","2 cloves of garlic , peeled","2 sticks of celery , trimmed","olive oil","2 rashers of higher-welfare smoked streaky bacon","½ a bunch of fresh thyme","500 g quality beef mince","a good splash of red wine","1 gluten-free beef stock cube , preferably organic","2 x 400 g tins of plum tomatoes","sea salt","freshly ground black pepper","1 x gluten-free pasta dough","1 litre semi-skimmed milk","35 g unsalted butter","25 g gluten-free plain flour","25 g corn flour","70 g Parmesan cheese","1 whole nutmeg , for grating"],"method":["To make the Bolognese sauce, finely chop the carrots, onions, garlic and celery and add to a large, wide pan over a medium heat with a drizzle of olive oil. Roughly chop and add the bacon, then pick in the thyme leaves and cook for 5 to 10 minutes, or until softened and lightly golden.","Turn the heat up slightly, then stir in the beef mince, breaking it up with a wooden spoon. Cook for around 5 minutes, or until browned all over. Add the wine and crumble in the stock cube, stirring continuously until the liquid has completely reduced. Stir in the tomatoes and 1 tin’s worth of water and bring to the boil. Reduce to a simmer, cover and cook for around 1 hour, then remove the lid and continue cooking for 30 minutes, or until thickened and reduced.","Meanwhile, preheat the oven to 180ºC,350ºF,gas 4. Make the béchamel sauce: place the milk, butter and flours in a medium pan over a low heat. Heat gently, whisking continuously for 12 to 15 minutes, or until thickened. Grate in three-quarters of the Parmesan and a good grating of nutmeg. Season to taste, then set aside.","Cut the sheets of pasta into rectangles (roughly 10cm x 15cm).","Spoon one-third of the Bolognese sauce into an ovenproof dish (roughly 25cm x 30cm). Layer over one-third of the lasagne sheets and top with one-third of the béchamel sauce. Repeat with the remaining ingredients until you have three layers in total, finishing with a final layer of béchamel. Grate over the remaining Parmesan and drizzle with olive oil, then cover with tin foil. Place in the hot oven for around 20 minutes, remove the foil and continue cooking for around 30 minutes, or until golden and bubbling. Serve with a nice, crisp salad. "]},{"_id":"5c16e3d8c1941d50c6ae0f13","category":"Beef","name":"Jamie's flash steak","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46259095.jpg?tr=w-430","http://www.eatout.co.za/wp-content/uploads/2014/11/jamie-recipe-28Sep11-014356.jpg","https://flockler.com/thumbs/sites/192/jo_easy5_hero_smokey_spanish_salmon_214_landscape_s600x600_c4300x2512_l0x185.jpg"],"ingredients":["4 feather steaks","16 fresh sage leaves","12 slices of prosciutto","a few sprigs of fresh soft herbs , such as parsley","extra virgin olive oil","1 lemon","12 ripe cherry tomatoes , mixed colours if possible","6 ripe baby plum tomatoes","6 ripe plum tomatoes","½ a bunch of fresh basil","2 cloves of garlic","80 ml extra virgin olive oil","½ lemon"],"method":["To make the salsa, quarter the cherry and baby plum tomatoes. Deseed the larger plum tomatoes, then cut into strips. Pick and slice the basil leaves, then peel and finely slice the garlic.","Place into a bowl with the oil and lemon juice, toss well, then season to taste with sea salt and black pepper.","Place the steaks on a board and season with salt and pepper. Lay 4 sage leaves on each steak, then cover each with 3 slices of prosciutto.","Take a meat hammer and pummel the steaks so that the prosciutto sticks to them, then lightly oil.","Get a griddle pan really hot, then add the steaks and cook to your liking, turning frequently.","Allow the steaks to rest for 5 minutes, then serve with the salsa picante, the chopped herb leaves and dressed with a little olive oil, lemon juice, salt and pepper. "]},{"_id":"5c16e401c1941d50c6ae0f14","category":"Beef","name":"Beef Wellington","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1357_1_1437987772.jpg?tr=w-430","https://www.seriouseats.com/recipes/images/2015/12/20121213-beef-wellington-food-lab%20-%2001-1500x1125.jpg","https://www.recipes.co.nz/ic/4112420676/Beef%20Wellington.1.jpg"],"ingredients":["4 feather steaks","16 fresh sage leaves","12 slices of prosciutto","a few sprigs of fresh soft herbs , such as parsley","extra virgin olive oil","1 lemon","12 ripe cherry tomatoes , mixed colours if possible","6 ripe baby plum tomatoes","6 ripe plum tomatoes","½ a bunch of fresh basil","2 cloves of garlic","80 ml extra virgin olive oil","½ lemon"],"method":["To make the salsa, quarter the cherry and baby plum tomatoes. Deseed the larger plum tomatoes, then cut into strips. Pick and slice the basil leaves, then peel and finely slice the garlic.","Place into a bowl with the oil and lemon juice, toss well, then season to taste with sea salt and black pepper.","Place the steaks on a board and season with salt and pepper. Lay 4 sage leaves on each steak, then cover each with 3 slices of prosciutto.","Take a meat hammer and pummel the steaks so that the prosciutto sticks to them, then lightly oil.","Get a griddle pan really hot, then add the steaks and cook to your liking, turning frequently.","Allow the steaks to rest for 5 minutes, then serve with the salsa picante, the chopped herb leaves and dressed with a little olive oil, lemon juice, salt and pepper. "]},{"_id":"5c16e491c1941d50c6ae0f15","category":"Beef","name":"Steak & guacamole wrap","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/803_1_1436890092.jpg?tr=w-430","http://cdn.shopify.com/s/files/1/2047/2825/articles/SteakFajitasGuacamole_BlueApron_high_feature_1024x1024.jpg?v=1534963657","https://www.chatelaine.com/wp-content/uploads/2005/09/Thai_beef_mango_wraps-1-l.jpg"],"ingredients":["1 large handful of shiitake mushrooms , optional","560 g piece of rib-eye steak , fat removed","1 teaspoon dried oregano","1 tablespoon sweet smoked paprika","4 flour tortillas","4 tablespoons fat-free natural yoghurt","1-2 fresh red chillies , optional","2 ripe avocados","2 ripe tomatoes","1 clove of garlic"],"method":["To make the guacamole, peel and destone the avocados, then place in a food processor.","Halve and add the tomatoes, peel, finely slice and add the garlic, then trim, finely slice and add the spring onions.","Sprinkle in the cumin, pick in most of the coriander leaves, then pulse to a chunky consistency, and scoop into a bowl.","Add a good squeeze of lime juice to the bowl, then taste and season to perfection with sea salt and black pepper. Drizzle lightly with extra virgin olive oil, then put aside.","Place a griddle pan over a high heat. Thickly slice the mushrooms (if using), then grill until golden and nutty, then remove and keep warm until needed.","Season the steak well with salt, pepper, oregano and paprika, then bash with the bottom of a heavy pan to flatten slightly.","Rub the steak with a little olive oil, then cook on the hot griddle for 5 minutes, or until cooked to your liking, turning every minute. Remove to a plate to rest. "]},{"_id":"5c16e54ec1941d50c6ae0f16","category":"Beef","name":"Versatile meat ragù","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/739_1_1436962741.jpg?tr=w-330,","https://i.pinimg.com/originals/ba/fc/0d/bafc0d5c844c595668cf95010f130277.jpg","https://maggieplum.files.wordpress.com/2011/09/pork-ragu.jpg"],"ingredients":["2 red onions","2 cloves of garlic","3 carrots","2 sticks of celery","1 butternut squash","6 rashers higher-welfare streaky bacon","4 tablespoons extra virgin olive oil","750 g higher-welfare minced pork","750 g minced beef","2 wineglasses red wine","5 x 400 g tins of plum tomatoes","3 sprigs of fresh rosemary","1 fresh bay leaf"],"method":["Start by prepping all your veg: peel and finely chop the onions, garlic and carrots, trim and finely slice the celery, then peel, deseed and finely chop the squash. Finely slice the bacon.","Heat the oil in a very large casserole pan over a medium-low heat, add the bacon, followed by the onion, garlic, carrot, celery and squash and cook gently for about 15 minutes, or until soft.","Add the mince, breaking it up with a spoon, and cook for about 10 minutes.","Turn the heat up, pour in the wine and leave to bubble and cook away for a few minutes, then tip in the tomatoes and 2 tins' worth of water. Drop in the rosemary sprigs and bay leaf, and season with sea salt and black pepper.","Bring to the boil, then cover and simmer for 1½ hours. After this time, if the ragù is still quite liquidy, remove the lid, turn the heat up and simmer for a few more minutes, or until thickened and reduced.","Eat straight away, or if you’re making this ahead of time, allow to cool, then divide between containers or plastic freezer bags."]},{"_id":"5c16e5c4c1941d50c6ae0f17","category":"Beef","name":"Perfect roast beef","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/389_1_1436872106.jpg?tr=w-430","http://richrosendale.com/site/assets/files/1270/perfectroastedbeef-5.jpg","https://www.telegraph.co.uk/content/dam/food-and-drink/2017/09/28/claridges-roast-beef_trans_NvBQzQNjv4Bqeo_i_u9APj8RuoebjoAHt0k9u7HhRJvuo-ZLenGRumA.jpg?imwidth=450"],"ingredients":["1.5 kg topside of beef","2 medium onions","2 carrots","2 sticks celery","1 bulb of garlic","1 bunch of mixed fresh herbs , such as thyme, rosemary, bay, sage","olive oil"],"method":["Remove the beef from the fridge 30 minutes before you want to cook it, to let it come up to room temperature.","Preheat the oven to 240°C,475°F, gas 9.","Wash and roughly chop the vegetables – there’s no need to peel them. Break the garlic bulb into cloves, leaving them unpeeled.","Pile all the veg, garlic and herbs into the middle of a large roasting tray and drizzle with oil.","Drizzle the beef with oil and season well with sea salt and black pepper, then rub all over the meat. Place the beef on top of the vegetables.","Place the tray in the oven, then turn the heat down immediately to 200°C","400°F","gas 6 and cook for 1 hour for medium beef. If you prefer it medium-rare, take it out 5 to 10 minutes earlier. For well done, leave it in for another 10 to 15 minutes. "]}]},{"_id":"5c2135f5e5253d205eec07ee","category":"Potato","image":"https://d5dnlg5k9nac9.cloudfront.net/processed/thumbs/ecb7fcf2aab3f4701a6e2f42ab4b8f7a78045aca_r791_530.png","recipes":[{"_id":"5c16fbd9c1941d50c6ae0f36","category":"Potato","name":"Basic latkes","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/83536218.jpg?tr=w-430","https://cdn-image.myrecipes.com/sites/default/files/styles/medium_2x/public/image/recipes/ck/08/12/potato-latkes-ck-1860088-x.jpg?itok=5h1jhEGU","https://img1.cookinglight.timeinc.net/sites/default/files/styles/4_3_horizontal_-_1200x900/public/image/2016/11/main/curried-carrot-latkes.jpg?itok=Aan2WYCj","https://www.gannett-cdn.com/presto/2018/11/29/PLOU/5030ca9a-4e51-44c5-b0b7-183e6bf4cf49-latke_basicIMG_3094.jpg?width=540&height=&fit=bounds&auto=webp","https://toriavey.com/images/2013/11/Latkes-IMAGE-6-740x555.jpg","http://ozuke.com/wp-content/uploads/2016/12/FN_Potato-Latkes_s4x3.jpg"],"ingredients":["2 large Maris Piper potatoes , (600g total)","1 onion , optional","4 tablespoons plain flour","2 large free-range eggs","vegetable oil , for frying","½ a bunch of fresh woody herbs , such as sage, rosemary, thyme (15g)"],"method":["Scrub the potatoes clean, then coarsely grate (skin and all). Peel and finely slice the onion (if using).","Place in the middle of a clean tea towel and wring out the liquid, then transfer to a large bowl.","Add the flour and crack in the eggs, season with sea salt and black pepper, then mix well to combine.","Place a large frying pan on a medium heat with enough oil to cover the bottom of the pan.","Shape small handfuls of the potato mixture (roughly the same size as a golf balls) into latkes, flattening gently, then carefully add to the pan – you may need to work in batches.","Fry for 1½ to 2 minutes on each side, or until golden and crisp, then drain on kitchen paper.","Pick the herbs and scatter into the pan with the remaining oil. Fry for a few seconds until crisp, then remove to the kitchen paper before sprinkling over the hot latkes."]},{"_id":"5c16fc48c1941d50c6ae0f37","category":"Potato","name":"Chicken skewers","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/83339331.jpg?tr=w-430","https://therecipecritic.com/wp-content/uploads/2017/05/0C4A8498.jpg","https://www.flavourandsavour.com/wp-content/uploads/2015/05/easy-thai-chicken-skewers-redo.jpg","https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/chicken_tandoori_74292_16x9.jpg"],"ingredients":["60 g blanched almonds","1 tablespoon balsamic vinegar","6 cloves of garlic","1 tablespoon baby capers in brine","6 anchovy fillets in oil , from sustainable sources","1 bunch of fresh flat-leaf parsley , (30g)","10 skinless, boneless free-range chicken thighs","10 slices of higher-welfare prosciutto","1.2 kg potatoes","300 g ripe cherry tomatoes"],"method":["Preheat the oven to 200ºC,400ºF,gas 6. Put the almonds into a food processor and pulse to rough crumbs. Peel and add the garlic, add the balsamic and capers, the anchovies and a splash of their oil, then tear in the top leafy half of the parsley and pulse until fairly fine. Open the chicken thighs out on to a board, smooth side down, and pound with your fist or a rolling pin until flattened and tenderized. Divide the stuffing between them and roll up, wrapping each thigh in a slice of prosciutto. Double skewer 5 thighs across two long metal skewers, then repeat.","Peel the potatoes and slice 1cm thick, then parboil in a large pan of boiling salted water for 6 minutes. Prick each tomato with the tip of a sharp knife and add to the pan for the last 40 seconds, then drain it all. Once cool enough to handle, pinch the skins off the tomatoes. Layer the potatoes in a large, sturdy baking dish, seasoning with sea salt and black pepper, and drizzling lightly with olive oil as you go, then scatter over the tomatoes. Nestle the skewers on top so that all the tasty juices drip down over the potatoes as they cook. Roast for 30 minutes. Dip the bunch of thyme in olive oil, then use it as a brush to baste the chicken and potatoes with the pan juices. Sprinkle the thyme sprigs over the dish and return to the oven for a final glorious 10 minutes. Slice between the skewers, then drizzle with extra virgin olive oil, to serve. If you like your potatoes super-crisp, pop them back into the oven for an extra 10 minutes at the end. "]},{"_id":"5c16fcd5c1941d50c6ae0f38","category":"Potato","name":"Epic lamb kebabs","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/64503803.jpg?tr=w-430","https://scontent-sea1-1.cdninstagram.com/vp/8bf2cae52cc585f8d83345235b6a5d9f/5C63FF45/t51.2885-15/e35/c0.135.1080.1080/s480x480/42157216_2013827008698628_1279268239067781843_n.jpg","https://img-3.journaldesfemmes.fr/zVGDWvcG_BsgZaGjrM6ITweYlus=/750x/smart/0ae54ddd5aa644b9a7c7944ced50b6f9/recipe-jdf/365625.jpg","https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fimg1.cookinglight.timeinc.net%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2Fimage%2F2017%2F04%2Fmain%2Fgrass-fed-beef-sirloin-kebabs-1706p122.jpg%3Fitok%3DDBQZKc9Q&w=1000&c=sc&poi=face&q=70"],"ingredients":["1.4 kg lamb shoulder , bone out","2 cloves of garlic","3 lemons","1 heaped tablespoon dried oregano , ideally the flowering kind","100 g feta cheese","150 g natural yoghurt","½ teaspoon smoked paprika"],"method":["Preheat the oven to 200ºC,400ºF,gas 6.","Score a criss-cross pattern into any fat on the lamb, then cut into 2cm-thick slices.","Peel the garlic and finely grate over the lamb with the zest of 1 lemon, then squeeze over its juice. Sprinkle over the oregano and season with a big pinch of sea salt and black pepper. Rub all over the meat, then cover and marinate in the fridge for 30 minutes.","For the chips, scrub the potatoes and slice into 1.5cm-thick chips, then parboil in a pan of boiling salted water for 6 to 8 minutes. Drain in a colander, leave to steam dry for 2 minutes, then lightly shake the colander to chuff up the chip edges.","Divide between two baking trays, then season from a height with salt, pepper and the dried oregano. Drizzle each tray with 2 tablespoons of olive oil and toss to coat. Roast in a single layer for 35 to 40 minutes, or until golden and crisp, turning halfway.","To make the flatbreads, mix the flour, yoghurt and a pinch of salt together into a dough. Knead on a clean flour-dusted surface for 1 minute to bring it all together, then roll into 8 balls. Cover with a damp cloth."]},{"_id":"5c16fd9cc1941d50c6ae0f39","category":"Potato","name":"Mark Hamill's roast sirloin & Yorkshire puddings","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/63138359.jpg?tr=w-430","http://cdn.jamieoliver.com/recipe-database/xtra_med/68834546.jpg","https://www.thespruceeats.com/thmb/2bpjqVWosGscjwxDxPUt-eubK1Y=/2121x1414/filters:fill(auto,1)/Roastbeef-yorkshirepudding-GettyImages-76944821-5915a3d25f9b586470400db9.jpg","https://www.hot-dinners.com/images/stories/blog/2015/bobbobsundaylunch/gallery/08bobbob.jpg","https://scm-assets.constant.co/scm/unilever/1db348501df1238f872479d225e08c34/1c832234-948a-4c8e-a136-c469e4504fc3.jpg","https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/10/23/12/roast-chop-house.jpg?w968"],"ingredients":["4 large free-range eggs","150 g plain flour","175 ml whole milk","50 g beef dripping","2 kg beef bones , with bone marrow","2 large leeks"],"method":["Ideally, make your Yorkie batter the night before. Whisk the eggs, flour, milk, 25ml of water and a pinch of sea salt to a smooth batter, then pop into the fridge overnight, removing when you preheat the oven for the meat (or, as a minimum, make the day you need it but leave to rest at room temperature for at least 30 minutes).","For the gravy, place the bones in a large roasting tray. Trim, wash and roughly chop the leeks, quarter the unpeeled onions, then add to the tray and roast for 45 minutes, or until golden brown.","Preheat the oven to 180ºC,350ºF,gas 4","Remove the bones and veg to a large pot, keeping the tray of juices to one side. Top up the pot with 2.5 litres of water, bring to the boil, then reduce to a simmer for at least 2 hours 30 minutes, or until the liquid has reduced by half.","Place the tray over a medium heat on the hob, then add the flour and stir well to pick up any sticky bits from the bottom. Pour in the wine and port, leave to bubble away for 1 minute, then gradually whisk in a few ladles of the stock, before tipping it all back into the pot.","Lift out the bones and strain the gravy, skimming off any fat from the surface, then adjust the seasoning, if needed. Keep aside to reheat at the last minute."]},{"_id":"5c16fe00c1941d50c6ae0f3a","category":"Potato","name":"Roast tikka chicken","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846380.jpg?tr=w-430","https://flockler.com/thumbs/sites/192/jo_easy5_hero_roast_tikka_chicken_197_s600x600_c3422x2001_l0x637.jpg","https://s3.amazonaws.com/finecooking.s3.tauntonclud.com/app/uploads/2017/04/18204932/fc81va069-01-main.jpg","https://pbs.twimg.com/media/DMMmi12WsAEavzl.jpg"],"ingredients":["800 g potatoes","1 small head of cauliflower (600g)","1 bunch of fresh coriander (30g)","1 x 1.2 kg whole free-range chicken","2 tablespoons tikka curry paste"],"method":["Preheat the oven to 180ºC,350ºF,gas 4. Wash the potatoes and chop into 3cm chunks. Trim the cauli stalk, remove any tough outer leaves, then chop the cauli and nice leaves the same size as the spuds. Finely slice the coriander stalks (reserving the leaves in a bowl of cold water). In a 30cm x 40cm roasting tray, toss the veg and coriander stalks with a pinch of sea salt and black pepper, and 1 tablespoon each of olive oil and red wine vinegar.","Sit the chicken in the tray and rub all over with the tikka paste, getting into all the nooks and crannies. Place the chicken directly on the bars of the oven, scrunch everything in the tray and place exactly underneath the chicken to catch the tasty juices. Roast for 1 hour, or until everything is golden and cooked through, turning the veg halfway. Sit the chicken on top of the veg to rest for 5 minutes, then sprinkle over the drained coriander leaves and serve, tossing the veg in all the tasty juices before dishing up. "]},{"_id":"5c16fe9ac1941d50c6ae0f3b","category":"Potato","name":"Potato & artichoke al forno","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/75993161.jpg?tr=w-430","https://pbs.twimg.com/media/DSOtXC8WAAM6ITF.jpg","http://www.italianrecipebook.com/wp-content/uploads/2018/01/Artichoke-Casserole.jpg","https://www.rachaelraymag.com/.image/t_share/MTQ3ODUyNDkxNzE4MDEwODAy/sauteed-artichokes-0809.jpg","http://devour-blog.com/wp-content/uploads/2014/07/SASP1.jpg"],"ingredients":["800 g baby new potatoes","2 large bulbs of fennel","1 x 280 g jar of artichoke hearts in oil","50 g Parmesan cheese","100 ml double cream"],"method":["Preheat the oven to 200ºC,400ºF,gas 6. Halve any larger new potatoes. Trim the fennel, pick and reserve any leafy tops, finely slice the stalky part, then halve the bulb and cut into 1cm slices. Put it all into a 30cm x 35cm roasting tray, halve the artichokes and add with 2 tablespoons of oil from their jar, as well as a really good pinch of black pepper, then toss it all together. Pour in 300ml of water, cover the tray tightly with tin foil, and bake for 1 hour.","In a bowl, finely grate half the Parmesan into the cream and loosen with a splash of water. When the time’s up, remove the tray from the oven, discard the foil, spoon over the cream mixture and finely grate over the remaining Parmesan. Bake for a final 20 minutes, or until golden and cooked through, then sprinkle over any reserved fennel tops before serving."]},{"_id":"5c16fee8c1941d50c6ae0f3c","category":"Potato","name":"Pork & mash gratin","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846378.jpg?tr=w-430","https://flockler.com/thumbs/sites/192/jo_easy5_hero_pig_in_prosciutto_909_s600x600_c3456x2019_l0x1477.jpg","https://images-gmi-pmc.edge-generalmills.com/64820f7d-71de-41e0-beb8-e770d94dda4e.jpg","https://c1.staticflickr.com/5/4366/37245447021_71c87d3ffb_b.jpg","http://www.salskitchenblog.com/wp-content/uploads/2018/01/Pork-296x300.jpg","http://cdn.jamieoliver.com/recipe-database/xtra_med/CRD7mBVCaJxBQuY170RSIo.jpg"],"ingredients":["800 g potatoes","400 g piece of higher-welfare pork fillet","2 sprigs of fresh sage","40 g Cheddar cheese","4 slices of higher-welfare prosciutto"],"method":["Preheat the grill to high. Wash the potatoes, chop into 3cm chunks, then cook in a large pan of boiling salted water with the lid on for 12 minutes, or until tender. Meanwhile, put a shallow casserole pan on a high heat. Season the pork with sea salt and black pepper, then place in the pan with 1 tablespoon of olive oil and sear for 3 minutes, turning regularly, while you pick the sage leaves. Remove the pork to a plate, toss the sage leaves into the fat in the pan for just 5 seconds, then scoop on to a plate, leaving the pan off the heat to use again.","Drain the spuds, tip into the casserole pan, grate over half the cheese, add 1 tablespoon of extra virgin olive oil and mash well, loosening with a splash of water, if needed. Taste, season to perfection, and spread out to the edges. Grate over the remaining cheese, sit the pork on top, then gratinate under the grill for 10 minutes. Lay the prosciutto around the pork in waves, sprinkle over the crispy sage, then grill for 2 more minutes, or until the pork is cooked to your liking. Rest for 2 minutes, then slice the pork and dish up. "]},{"_id":"5c16ff93c1941d50c6ae0f3d","category":"Potato","name":"Best roast potatoes","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/51137607.jpg?tr=w-430","https://www.bbcgoodfood.com/sites/default/files/recipe/recipe-image/2009/03/roast-potatoes-main.jpg","https://scms.machteamsoft.ro/uploads/photos/original/174031-cartofi-copti.jpg","https://www.quartiere.ro/assets/images/cartofi2.jpg","https://www.bordbia.ie/SiteCollectionImages/Recipes/christmas/perfect-roast-potatoes.png","https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2018/08/potatoes.jpg?itok=CcN8Lqog"],"ingredients":["2.5 kg medium Maris Piper potatoes","4 tablespoons goose fat or unsalted butter","olive oil","1 bulb of garlic","½ bunch fresh sage"],"method":["Preheat the oven to 180°C,350°F,gas 4. ","Peel the potatoes, keeping them whole, and ideally all about the same size (8cm). Parboil them in a pan of boiling salted water for 15 minutes – this will ensure that the insides become really fluffy.","Drain in a colander and leave to steam dry for 2 minutes – this will help the fat to stick to the potatoes. Give the colander a few light shakes to chuff up the edges of the potatoes, giving you maximum surface area for a crispy exterior as they roast.","Place the goose fat or butter and 1 tablespoon of oil in your largest roasting tray. Tip in the potatoes, add a good pinch of sea salt and black pepper, then toss to coat, and spread out in one fairly snug, even layer but with small gaps between them.","Squash the garlic bulb, then lightly crush each unpeeled clove and add to the tray – this gives you sweet, caramelised garlic and adds a gentle perfume to the potatoes.","Roast for 1 hour, or until the potatoes are crisp and golden all over.","Remove the tray from the oven. We’re nearly there, but we’ve got one last application of love and care, which is the game-changer. Gently half-squash each potato with a fish slice or masher so they kind of push into each other and fill the tray. "]},{"_id":"5c170050c1941d50c6ae0f3e","category":"Potato","name":"Potato al forno","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/47750601.jpg?tr=w-430","http://www.damonleefowler.com/images/DSC05323-680.jpg","http://cdn.jamieoliver.com/videos/images/youtube/sX1eGd9BNY4_large.jpg","https://cook.fnr.sndimg.com/content/dam/images/cook/fullset/2010/10/14/0/CCDRD204_pasta-al-for_s4x3.jpg.rend.hgtvcom.616.462.suffix/1386439630587.jpeg"],"ingredients":["1 kg Maris Piper potatoes","2 onions","2 bulbs of fennel","600 ml whole milk","400 ml double cream","6 anchovy fillets , in oil","8 cloves of garlic","½ a bunch of fresh rosemary , (15g)","6 fresh bay leaves","1 whole nutmeg , for grating","50 g Parmesan cheese"],"method":["Peel the potatoes and onions and trim the fennel bulbs, reserving any herby fennel tops for later.","Finely slice the potatoes, onions and fennel just under ½cm thick, with patient knife skills or, ideally, on a mandolin (use the guard!).","Preheat the oven to 180ºC,350ºF,gas 4.","Pour the milk and cream into a pan. Tear in the anchovies, crush in the unpeeled garlic through a garlic crusher, add the rosemary sprigs and bay leaves and finely grate in half the nutmeg.","Bring to a light boil on a medium heat, then immediately turn the heat off and leave to infuse for a few minutes. Fish out and discard the herbs, finely grate and whisk in most of the Parmesan, then taste and season to perfection.","In a 25cm x 30cm baking dish, layer up the slices of potato, onion and fennel. Pour over the cream mixture and finely grate over the remaining Parmesan.","Cover with tin foil and bake for 30 minutes, then remove the foil and bake for another 45 minutes, or until tender and nicely golden.","Remove from the oven, tear and scatter over any reserved fennel tops, and serve. "]},{"_id":"5c1700abc1941d50c6ae0f3f","category":"Potato","name":"Hasselbacks","img":["https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/51137616.jpg?tr=w-330,","https://www.panningtheglobe.com/wp-content/uploads/2013/01/hasselbacks-overview-web.jpg","http://foodista.com/sites/default/files/hasselbacks.jpg","https://d1ozebeurs5bq4.cloudfront.net/assets/images/recipes/Hasselbacks-w-Smoked-Yoghurt-web.jpg?mtime=20181031143301","https://ahintofgarlic.files.wordpress.com/2011/09/hasselback-potato.jpg","http://www.keukenmeid.com/wp-content/uploads/2018/02/IMG_8961.jpg"],"ingredients":["2.5 kg Maris Piper potatoes , choose the smallest ones","½ a bunch of fresh thyme (15g)","4 tablespoons higher-welfare turkey dripping , or olive oil","50 g stale bread","40 g hazelnuts","100 g blue cheese"],"method":["The fun and unique part of this side dish is that you need to slice multiple times through the potatoes, but – importantly – without going all the way through, giving you a kind of concertina-style potato. This looks beautiful but also makes them wonderfully absorbent of flavour and amplifies their crispiness. Try to choose small potatoes, give them a wash, and if you have any larger ones, cut them in half and use the flat side as a base.","To make this process as simple as possible, place a potato on a board between the handles of two wooden spoons, so that when you slice down into the potato the spoons stop the blade from going all the way through.","Carefully slice at just under ½cm intervals all the way along. Repeat with all the potatoes, placing them in a large roasting tray as you go.","Pick half the thyme leaves into a pestle and mortar and pound with the turkey dripping or oil. Spoon over the potatoes, making sure the fat gets down into the cuts you’ve made, then season with sea salt and black pepper.","Roast for 1 hour, or until the potatoes are golden and tender."]}]}]